blog/2017/07/10/python-cookbook-readnote/index.html
<!DOCTYPE html>
<html lang="en-us">
  <head>
    <title>Python Cookbook 读书笔记 - Astropeak 的编程笔记</title>
    <meta charset="utf-8" />
    <meta name="author" content="Astropeak" />
    <meta name="description" content="Python coookbook reading notes" />
    <meta name="keywords" content="python, cookbook, reading notes" />
    <link rel="stylesheet" href="/media/css/main.css" type="text/css">
    <link rel="stylesheet" href="/media/css/prettify.css" type="text/css">
  </head>
  <body class="container">
    <div>
      <header class="masthead">
        <h1 class="masthead-title"><a href="/">Astropeak 的编程笔记</a></h1>
        <p></p>
        <ul>
          <li><a href="/blog/">Blog</a></li>
          <li><a href="/tags/">Tags</a></li>
          <li><a href="/about/">About</a></li>
          <li><a href="https://github.com/astropeak">GitHub</a></li>
          <li><a href="/rss.xml">RSS</a></li>
        </ul>
        <form method="get" id="searchform" action="//www.google.com/search">
          <input type="text" class="field" name="q" id="s" placeholder="Search">
          <input type="hidden" name="as_sitesearch" value="astropeak.github.io">
        </form>
      </header>
    </div>

<div>
<div class="post">
<h1>Python Cookbook 读书笔记</h1>
<p>
《<a href="http://shop.oreilly.com/product/0636920027072.do">Python Cookbook</a>》读书笔记.
</p>
<div id="outline-container-org3e33dc5" class="outline-2">
<h2 id="org3e33dc5">chapter 1: Data Structures and Algorithms</h2>
<div class="outline-text-2" id="text-org3e33dc5">
</div><div id="outline-container-org1400acd" class="outline-3">
<h3 id="org1400acd">1.6 Mapping Keys to Multiple Values in a Dictionary, by list value and defaultdict</h3>
<div class="outline-text-3" id="text-org1400acd">
<p>
example: create a dictionary with default value, by defaultdict
</p>

<p>
dictionary's property:
</p>
<ol class="org-ol">
<li>you can add new key to a dictionary</li>
<li>but when you access a key that not exists, there will be error</li>
<li>defaultdict is used to fix such problem.</li>
</ol>

<div class="org-src-container">
<pre class="src src-python">from collections import defaultdict
`dict` = defaultdict(`func list`)
# `dict`['aaa'].append(2)
$0
</pre>
</div>
</div>
</div>

<div id="outline-container-orge7b906a" class="outline-3">
<h3 id="orge7b906a">1.6 example</h3>
<div class="outline-text-3" id="text-orge7b906a">
<div class="org-src-container">
<pre class="src src-python">from collections import defaultdict
frequency = defaultdict(int)
frequency['colorless'] = 4
frequency['ideas'] # will be 0

frequency = defaultdict(list)
# first, frequency['colorless'] will return a empty list, then append one element to this list.
frequency['colorless'].append(4)
frequency['ideas'] # will be []

# Or you can pass a function take no arguments 

# the idiom:
my_dictionary = defaultdict(function to create default value)
for item in sequence:
my_dictionary[item_key] is updated with information about item
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf6af971" class="outline-3">
<h3 id="orgf6af971">1.7 Keeping Dictionaries in Order, OrderedDict</h3>
<div class="outline-text-3" id="text-orgf6af971">
<div class="org-src-container">
<pre class="src src-python">form collections import OrderedDict
d = OrderedDict()
# the insertion order will be reserved.
</pre>
</div>

<p>
An typical application is when for serilization.
</p>
</div>
</div>

<div id="outline-container-orga193cdf" class="outline-3">
<h3 id="orga193cdf">1.8. Calculating with Dictionaries</h3>
<div class="outline-text-3" id="text-orga193cdf">
</div><div id="outline-container-orgce1c01b" class="outline-4">
<h4 id="orgce1c01b">get max key/value in a dictionary, based on the value, by inverting the dict</h4>
<div class="outline-text-4" id="text-orgce1c01b">
<div class="org-src-container">
<pre class="src src-python">max(zip(`dict`.values(), `dict`.keys()))
# another solution
# max(`dict`, key=lambda k:`dict`[k])
</pre>
</div>
<p>
first convert the dict to list of (value, key) pairs, then max function will first compare value, then compare key.
</p>
</div>
</div>
<div id="outline-container-orgad4d7b6" class="outline-4">
<h4 id="orgad4d7b6">result of the max value for many  things</h4>
<div class="outline-text-4" id="text-orgad4d7b6">
<p>
for tuple and list, it just the element.
but for a dict, it returns only the key. Why? Because it accept a iterable as first parameter, and for a dictionary, the iterable value is the key.
</p>
</div>
</div>
<div id="outline-container-orgc4b9c60" class="outline-4">
<h4 id="orgc4b9c60">understanding of multi value bind</h4>
<div class="outline-text-4" id="text-orgc4b9c60">
<p>
---&gt;  (b11, b12) = 1
TypeError: 'int' object is not iterable
</p>

<p>
The right hand side should be an iterable, every element in the iterable will be asigned to the left hand side variable, with each variable comsume one element exzactly. If the number of elements and variables not match, then there will be an error.
</p>

<p>
To consume more than one values, use the '*varname' expresstion, then the variable 'varname' will be a list of many elements.
</p>

<p>
Back to the error prints in the example, the 'int' object refers to the right side '1'.
</p>

<p>
PS:
I find python much simpler and funny than java.
</p>
</div>
</div>
</div>
<div id="outline-container-orgf5cc5f7" class="outline-3">
<h3 id="orgf5cc5f7">1.9. Finding Commonalities in Two Dictionaries</h3>
<div class="outline-text-3" id="text-orgf5cc5f7">
<p>
a dictionary's d.keys() and d.items() support set operations
So to find the common part keys/items in two dictionaries, just use the set operation '|' or 'union' function.
</p>
</div>
<div id="outline-container-org184b7ec" class="outline-4">
<h4 id="org184b7ec">get all keys as a iterable in a dictionary, by keys()</h4>
<div class="outline-text-4" id="text-org184b7ec">
<div class="org-src-container">
<pre class="src src-python">`dict`.keys()
</pre>
</div>
</div>
</div>

<div id="outline-container-org8c1099d" class="outline-4">
<h4 id="org8c1099d">get all values as a iterable in a dictionary, by values()</h4>
<div class="outline-text-4" id="text-org8c1099d">
<div class="org-src-container">
<pre class="src src-python">`dict`.values()
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf608e18" class="outline-4">
<h4 id="orgf608e18">get all key, value pairs as a iterable in a dictionary, by items()</h4>
<div class="outline-text-4" id="text-orgf608e18">
<div class="org-src-container">
<pre class="src src-python">`dict`.items()
</pre>
</div>
</div>
</div>

<div id="outline-container-org8106e17" class="outline-4">
<h4 id="org8106e17">set operations</h4>
<div class="outline-text-4" id="text-org8106e17">
<p>
'|': union
'&amp;': intersection
'-': difference
's1 &lt; s2': check if s1 is a subset of s2
</p>

<p>
Example:
In [101]: e.keys(), d.keys()
Out[101]: (dict_keys([1, 4, 'a', 9]), dict_keys([1, 3, 5]))
</p>

<p>
In [102]: e.keys() &amp; d.keys()
Out[102]: {1}
</p>

<p>
In [103]: e.keys() | d.keys()
Out[103]: {1, 3, 4, 5, 'a', 9}
</p>

<p>
In [104]: e.keys() - d.keys()
Out[104]: {9, 4, 'a'}
</p>
</div>
</div>
</div>

<div id="outline-container-org02746ff" class="outline-3">
<h3 id="org02746ff">1.10. Removing Duplicates from a Sequence while Maintaining Order</h3>
<div class="outline-text-3" id="text-org02746ff">
</div><div id="outline-container-org37e67bc" class="outline-4">
<h4 id="org37e67bc">problem: what is hashable(and the link to python glossary)</h4>
<div class="outline-text-4" id="text-org37e67bc">
<p>
From the python glossary: 
<a href="https://docs.python.org/3/glossary.html">https://docs.python.org/3/glossary.html</a>
</p>

<p>
An object is hashable if it has a hash value which never changes during its lifetime (it needs a __hash__() method), and can be compared to other objects (it needs an __eq__() or __cmp__() method). Hashable objects which compare equal must have the same hash value.
</p>

<p>
Hashability makes an object usable as a dictionary key and a set member, because these data structures use the hash value internally.
</p>

<p>
All of Python’s immutable built-in objects are hashable, while no mutable containers (such as lists or dictionaries) are. Objects which are instances of user-defined classes are hashable by default; they all compare unequal, and their hash value is their id().
</p>
</div>
</div>
<div id="outline-container-org344c907" class="outline-4">
<h4 id="org344c907">how yield/generator iterator is implemented</h4>
<div class="outline-text-4" id="text-org344c907">
<p>
From the glossary, it works by suspends the function and  return the value, and save the current status. Then if it was called  next time, it will start execute from the place last time it was suspended. Great!! I understanded this.
</p>

<p>
generator
A function which returns a generator iterator. It looks like a normal function except that it contains yield expressions for producing a series of values usable in a for-loop or that can be retrieved one at a time with the next() function.
Usually refers to a generator function, but may refer to a generator iterator in some contexts. In cases where the intended meaning isn’t clear, using the full terms avoids ambiguity.
</p>

<p>
generator iterator
An object created by a generator function.
Each yield temporarily suspends processing, remembering the location execution state (including local variables and pending try-statements). When the generator iterator resumes, it picks-up where it left-off (in contrast to functions which start fresh on every invocation).
</p>
</div>
</div>
