blog/python-cookbook-readnote.org
*** file object is also an iterable, the element is a line
    #+begin_src python
    with open(somefile,'r') as f:
        for line in f:
            print(line)
    #+end_src
    
*** a function that delete all duplicates in a list, with order preserved
    #+begin_src python
    def dedupe(items, key=None):
        seen = set()
        for item in items:
            val = item if key is None else key(item)
            if val not in seen:
                yield item
                seen.add(val)
    #+end_src
    If the element is hashable, then key function is not needed. Else, provide a fucntion to convert the  element to a hashable element.
    
    examples:
    >>> a = [ {'x':1, 'y':2}, {'x':1, 'y':3}, {'x':1, 'y':2}, {'x':2, 'y':4}]
    >>> list(dedupe(a, key=lambda d: (d['x'],d['y'])))
    [{'x': 1, 'y': 2}, {'x': 1, 'y': 3}, {'x': 2, 'y': 4}]
    >>> list(dedupe(a, key=lambda d: d['x']))
    [{'x': 1, 'y': 2}, {'x': 2, 'y': 4}]
    >>>
    
*** delete all duplicates in a list, don't preserve order, by set
    #+begin_src python
    set(`list`)
    #+end_src
    Then all duplicate elements in list will be removed.
    
*** the a?b:c expression in python, if else in one line
    #+begin_src python
    val = b if a else c
    #+end_src
    looks good
    
** 1.11. Naming a Slice
*** the slice object
    create a  slice
    #+begin_src python
   a=[1,2,3,4]
   s = slice(1,2)
   print(a[s])
   print(a[1:2])
    #+end_src
    '1:2' is just a shortcut to 'slice(1,2)'
    
    slice attributes
    #+begin_src python
    s = slice(1,2,2)
    print(s.start, s.stop, s.step)
    #+end_src
    
    #+RESULTS:
    
    
** 1.12. Determining the Most Frequently Occurring Items in a Sequence
   A method by me
   #+begin_src python
   a = [1, 2, 1, 3, 2,3,3]
   from collections import defaultdict
   d = defaultdict(int)
   # b = [d[k]+=1 for k in a]  # syntax error here
   for k in a:
       d[k]+=1

   r = max(zip(d.values(), d.keys()))
   print(r[1])
   #+end_src
   
   
*** the collections.Counter class: change a list to a list of tuple of (element, count)
    #+begin_src python :results output
    a = [1, 2, 1, 3, 2,3,3]
    from collections import Counter
    b = Counter(a)
    c = b.most_common(1)
    print(c[0][0])

    # get the count
    print(b[3]) # 3 is the element in a


    # update with more words
    b.update([4, 2, 5])

    # and a Counter object support the math operations: '+' and '-'

    #+end_src
    
    #+RESULTS:
    : 3
    : 3
    
    When you need to count data, use Counter class. This is a so little class, in practice, I will always write it from scratch before.
    
** 1.13. Sorting a List of Dictionaries by a Common Key
   
*** the operator.itemgetter function
    it will return a callable that can be passed to 'sorted':s key  parameter, for list  or dictionary
    #+begin_src python
    # return value of
    import operator
    operator.itemgetter("name")
    # is the same as this one
    lambda r:r["name"]
    # but the former  is a little faster
    #+end_src
    
    仍然是非常小的功能，为什么搞得这么精细呢？
    
** 1.14. Sorting Objects Without Native Comparison Support
*** the operator.attrgetter function
    it will return a callable that can be passed to 'sorted':s key  parameter, for user defined class
    #+begin_src python
    class User():
        def __init__(self, name):
            self.name = name

        def __repr__(self):
            return 'User({})'.format(self.name)

    # return value of
    operator.attrgetter("name")
    # is the same as this one
    lambda o:o.name
    # but the former  is a little faster
    #+end_src
** 1.15. Grouping Records(a sequence of dictionaries) Together Based on a Field
*** the itertools.groupby function: group sequencially the list as tuple (key, items)
    #+begin_src python
    import itertools
    rows =  [{1:2}, {1: 4},  {1: 3}]
    # a should be a generator
    rows.sort(key=itemgetter(1))
    a = itertools.groupby(rows, key=itemgetter(1))
    #+end_src
    
    another way is just use a default list dictionary to group, then no sort is needed.
    
    
    
    
    
    
** 1.16. Filtering Sequence Elements
   To fitering, just use list comprehension with an if condition
*** itertools.compress function, a filtering tool
    it takse two parameters:
    1. an iterable which to be compressed
    2. a Boolean sequence, with the same length of first parameter
       if the element in this sequence  is True, then the element at the same position in the first iterable will be put to the output
       
       An example:
    #+begin_src python
    addresses = [
        '5412 N CLARK',
        '5148 N CLARK',
        '5800 E 58TH',
        '2122 N CLARK'
        '5645 N RAVENSWOOD',
        '1060 W ADDISON',
        '4801 N BROADWAY',
        '1039 W GRANVILLE',
    ]
    counts = [ 0, 3, 10, 4, 1, 7, 6, 1]

    import itertools
    b = [e > 5 for e in counts]
    a = itertools.compress(addresses, b)
    # Now a will be all items where count larger than 5
    print(a)
    #+end_src
    
    
    
** 1.17. Extracting a Subset of a Dictionary
*** dictionary comprehension, just like list comprehension, but use '{' instead of '['
    #+begin_src python
    prices = {
        'ACME': 45.23,
        'AAPL': 612.78,
        'IBM': 205.55,
        'HPQ': 37.20,
        'FB': 10.75
    }
    # Make a dictionary of all prices over 200
    p1 = { key:value for key, value in prices.items() if value > 200 }
    # Make a dictionary of tech stocks
    tech_names = { 'AAPL', 'IBM', 'HPQ', 'MSFT' }
    p2 = { key:value for key,value in prices.items() if key in tech_names }
    #+end_src
** 1.18. Mapping Names to Sequence Elements
