blog/2017/07/10/python-cookbook-readnote/index.html

<div id="outline-container-orgce6eb47" class="outline-4">
<h4 id="orgce6eb47">file object is also an iterable, the element is a line</h4>
<div class="outline-text-4" id="text-orgce6eb47">
<div class="org-src-container">
<pre class="src src-python">with open(somefile,'r') as f:
    for line in f:
        print(line)
</pre>
</div>
</div>
</div>

<div id="outline-container-org78a780b" class="outline-4">
<h4 id="org78a780b">a function that delete all duplicates in a list, with order preserved</h4>
<div class="outline-text-4" id="text-org78a780b">
<div class="org-src-container">
<pre class="src src-python">def dedupe(items, key=None):
    seen = set()
    for item in items:
        val = item if key is None else key(item)
        if val not in seen:
            yield item
            seen.add(val)
</pre>
</div>
<p>
If the element is hashable, then key function is not needed. Else, provide a fucntion to convert the  element to a hashable element.
</p>

<p>
examples:
&gt;&gt;&gt; a = [ {'x':1, 'y':2}, {'x':1, 'y':3}, {'x':1, 'y':2}, {'x':2, 'y':4}]
&gt;&gt;&gt; list(dedupe(a, key=lambda d: (d['x'],d['y'])))
[{'x': 1, 'y': 2}, {'x': 1, 'y': 3}, {'x': 2, 'y': 4}]
&gt;&gt;&gt; list(dedupe(a, key=lambda d: d['x']))
[{'x': 1, 'y': 2}, {'x': 2, 'y': 4}]
&gt;&gt;&gt;
</p>
</div>
</div>

<div id="outline-container-org1ec1b72" class="outline-4">
<h4 id="org1ec1b72">delete all duplicates in a list, don't preserve order, by set</h4>
<div class="outline-text-4" id="text-org1ec1b72">
<div class="org-src-container">
<pre class="src src-python">set(`list`)
</pre>
</div>
<p>
Then all duplicate elements in list will be removed.
</p>
</div>
</div>

<div id="outline-container-org665e692" class="outline-4">
<h4 id="org665e692">the a?b:c expression in python, if else in one line</h4>
<div class="outline-text-4" id="text-org665e692">
<div class="org-src-container">
<pre class="src src-python">val = b if a else c
</pre>
</div>
<p>
looks good
</p>
</div>
</div>
</div>

<div id="outline-container-org05286ba" class="outline-3">
<h3 id="org05286ba">1.11. Naming a Slice</h3>
<div class="outline-text-3" id="text-org05286ba">
</div><div id="outline-container-orgff5c901" class="outline-4">
<h4 id="orgff5c901">the slice object</h4>
<div class="outline-text-4" id="text-orgff5c901">
<p>
create a  slice
</p>
<div class="org-src-container">
<pre class="src src-python">a=[1,2,3,4]
s = slice(1,2)
print(a[s])
print(a[1:2])
</pre>
</div>
<p>
'1:2' is just a shortcut to 'slice(1,2)'
</p>

<p>
slice attributes
</p>
<div class="org-src-container">
<pre class="src src-python">s = slice(1,2,2)
print(s.start, s.stop, s.step)
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-orgb536467" class="outline-3">
<h3 id="orgb536467">1.12. Determining the Most Frequently Occurring Items in a Sequence</h3>
<div class="outline-text-3" id="text-orgb536467">
<p>
A method by me
</p>
<div class="org-src-container">
<pre class="src src-python">a = [1, 2, 1, 3, 2,3,3]
from collections import defaultdict
d = defaultdict(int)
# b = [d[k]+=1 for k in a]  # syntax error here
for k in a:
    d[k]+=1

r = max(zip(d.values(), d.keys()))
print(r[1])
</pre>
</div>
</div>


<div id="outline-container-org08979ab" class="outline-4">
<h4 id="org08979ab">the collections.Counter class: change a list to a list of tuple of (element, count)</h4>
<div class="outline-text-4" id="text-org08979ab">
<div class="org-src-container">
<pre class="src src-python">a = [1, 2, 1, 3, 2,3,3]
from collections import Counter
b = Counter(a)
c = b.most_common(1)
print(c[0][0])

# get the count
print(b[3]) # 3 is the element in a


# update with more words
b.update([4, 2, 5])

# and a Counter object support the math operations: '+' and '-'

</pre>
</div>

<p>
When you need to count data, use Counter class. This is a so little class, in practice, I will always write it from scratch before.
</p>
</div>
</div>
</div>

<div id="outline-container-org1842959" class="outline-3">
<h3 id="org1842959">1.13. Sorting a List of Dictionaries by a Common Key</h3>
<div class="outline-text-3" id="text-org1842959">
</div><div id="outline-container-orgb04ec6c" class="outline-4">
<h4 id="orgb04ec6c">the operator.itemgetter function</h4>
<div class="outline-text-4" id="text-orgb04ec6c">
<p>
it will return a callable that can be passed to 'sorted':s key  parameter, for list  or dictionary
</p>
<div class="org-src-container">
<pre class="src src-python"># return value of
import operator
operator.itemgetter("name")
# is the same as this one
lambda r:r["name"]
# but the former  is a little faster
</pre>
</div>

<p>
仍然是非常小的功能，为什么搞得这么精细呢？
</p>
</div>
</div>
</div>

<div id="outline-container-orgeb221b9" class="outline-3">
<h3 id="orgeb221b9">1.14. Sorting Objects Without Native Comparison Support</h3>
<div class="outline-text-3" id="text-orgeb221b9">
</div><div id="outline-container-org4215b48" class="outline-4">
<h4 id="org4215b48">the operator.attrgetter function</h4>
<div class="outline-text-4" id="text-org4215b48">
<p>
it will return a callable that can be passed to 'sorted':s key  parameter, for user defined class
</p>
<div class="org-src-container">
<pre class="src src-python">class User():
    def __init__(self, name):
        self.name = name

    def __repr__(self):
        return 'User({})'.format(self.name)

# return value of
operator.attrgetter("name")
# is the same as this one
lambda o:o.name
# but the former  is a little faster
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgf847675" class="outline-3">
<h3 id="orgf847675">1.15. Grouping Records(a sequence of dictionaries) Together Based on a Field</h3>
<div class="outline-text-3" id="text-orgf847675">
</div><div id="outline-container-orgf753e35" class="outline-4">
<h4 id="orgf753e35">the itertools.groupby function: group sequencially the list as tuple (key, items)</h4>
<div class="outline-text-4" id="text-orgf753e35">
<div class="org-src-container">
<pre class="src src-python">import itertools
rows =  [{1:2}, {1: 4},  {1: 3}]
# a should be a generator
rows.sort(key=itemgetter(1))
a = itertools.groupby(rows, key=itemgetter(1))
</pre>
</div>

<p>
another way is just use a default list dictionary to group, then no sort is needed.
</p>
</div>
</div>
</div>






<div id="outline-container-org4b4f9b5" class="outline-3">
<h3 id="org4b4f9b5">1.16. Filtering Sequence Elements</h3>
<div class="outline-text-3" id="text-org4b4f9b5">
<p>
To fitering, just use list comprehension with an if condition
</p>
</div>
<div id="outline-container-orgc46cbba" class="outline-4">
<h4 id="orgc46cbba">itertools.compress function, a filtering tool</h4>
<div class="outline-text-4" id="text-orgc46cbba">
<p>
it takse two parameters:
</p>
<ol class="org-ol">
<li>an iterable which to be compressed</li>
<li><p>
a Boolean sequence, with the same length of first parameter
if the element in this sequence  is True, then the element at the same position in the first iterable will be put to the output
</p>

<p>
An example:
</p></li>
</ol>
<div class="org-src-container">
<pre class="src src-python">addresses = [
    '5412 N CLARK',
    '5148 N CLARK',
    '5800 E 58TH',
    '2122 N CLARK'
    '5645 N RAVENSWOOD',
    '1060 W ADDISON',
    '4801 N BROADWAY',
    '1039 W GRANVILLE',
]
counts = [ 0, 3, 10, 4, 1, 7, 6, 1]

import itertools
b = [e &gt; 5 for e in counts]
a = itertools.compress(addresses, b)
# Now a will be all items where count larger than 5
print(a)
</pre>
</div>
</div>
</div>
</div>



<div id="outline-container-orgaa15553" class="outline-3">
<h3 id="orgaa15553">1.17. Extracting a Subset of a Dictionary</h3>
<div class="outline-text-3" id="text-orgaa15553">
</div><div id="outline-container-orgbe82dcb" class="outline-4">
<h4 id="orgbe82dcb">dictionary comprehension, just like list comprehension, but use '{' instead of '['</h4>
<div class="outline-text-4" id="text-orgbe82dcb">
<div class="org-src-container">
<pre class="src src-python">prices = {
    'ACME': 45.23,
    'AAPL': 612.78,
    'IBM': 205.55,
    'HPQ': 37.20,
    'FB': 10.75
}
# Make a dictionary of all prices over 200
p1 = { key:value for key, value in prices.items() if value &gt; 200 }
# Make a dictionary of tech stocks
tech_names = { 'AAPL', 'IBM', 'HPQ', 'MSFT' }
p2 = { key:value for key,value in prices.items() if key in tech_names }
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgc5f91ee" class="outline-3">
<h3 id="orgc5f91ee">1.18. Mapping Names to Sequence Elements</h3>
