blog/python-cookbook-readnote.org
*** the collections.nametuple function, map an index to a name, and access to an element with that name
    example:
    #+begin_src python
    from collections import namedtuple
    People =  namedtuple('People', ['name', 'age'])
    p = People(name='Jim', age=12)
    print(p, p.name, p.age)
    #+end_src
    
    #+RESULTS:
    
    A good application:
    for database selection.
    
    The ._replace method:
    Because a tuple is immutable, so to change an element, you can use _replace to  replace a field and a new one will be returned.
    A tipical usage is first  create a prototype element with all field value be the default one, then update some fields with the _replace function.
    Why there is a '_' in the function name?
    #+begin_src python
    from collections import namedtuple
    Stock = namedtuple('Stock', ['name', 'shares', 'price', 'date', 'time'])
    # Create a prototype instance
    stock_prototype = Stock('', 0, 0.0, None, None)
    # Function to convert a dictionary to a Stock
    def dict_to_stock(s):
        return stock_prototype._replace(**s)

    a = {'name': 'ACME', 'shares': 100, 'price': 123.45}
    dict_to_stock(a)
    # Stock(name='ACME', shares=100, price=123.45, date=None, time=None)
    #+end_src
    
** 1.19. Transforming and Reducing Data at the Same Time
   use generator-expression argument
   
   The reducing function means: given a list, return a value.
** the any function, check if any of an element is True in a iterable
*** check if  any .py files exist in a directory
    #+begin_src python
   # Determine if any .py files exist in a directory
   import os
   files = os.listdir('dirname')
   if any(name.endswith('.py') for name in files):
       print('There be python!')
   else:
       print('Sorry, no python.')
    #+end_src
*** get all files in a directory as a list
    #+begin_src python
   import os
   files = os.listdir('dirname')
    #+end_src
*** change a tuple/list/iterable to a csv line
    This is much better than the string format method
    #+begin_src python
    # Output a tuple as CSV
    s = ('ACME', 50, 123.45)
    print(','.join(str(x) for x in s))# Output a tuple as CSV
    #+end_src
    
** 1.20. Combining Multiple Mappings into a Single Mapping
*** the collections.ChainMap
    combining many maps/dictionaries, then when get an element, it will try to get from the first map, then the second, ...
    
    And for operations that mutate the mapping always affect the first map/dictionary.
    
    typical application:
    scoped variable in a programming language.
    
    Difference from the dict.update function:
    ChainMap use a link to the original dictionary, while dict.update create a new one.
**** check if an element exists in many dictionaries/maps, sequencially
     #+begin_src python :results output
     a = {'x': 1, 'z': 3 }
     b = {'y': 2, 'z': 4 }
     from collections import ChainMap
     c = ChainMap(a,b)
     print(c['x']) # Outputs 1 (from a)
     print(c['y']) # Outputs 2 (from b)
     print(c['z']) # Outputs 3 (from a)
     #+end_src
     
     #+RESULTS:
     : 1
     : 2
     : 3
* chapter 2: Strings and Text
** 2.1. Splitting Strings on Any of Multiple Delimiters
   By us re.split and the regexp is r'[,;\s]\s*'
*** difference between str.split and re.split
    str.split only accept simple seperator
    re.split accept regulare expression.
*** return value of re.split
    1. if there are no capture group, then the same as str.split
    2. if there are capture group, then all matched data will also be returned.
       then the value will be rst[::2], the seperator will be rst[1::2]
       #+begin_src python :results output
       s = "I, you; a  seperater.   haha"
       import re
       a = re.split(r'[,;.\s]\s*', s)
       print(a)

       a = re.split(r'([,;.\s]\s*)',s)
       print(a, a[::2], a[1::2])
       #+end_src
       
       #+RESULTS:
       : ['I', 'you', 'a', 'seperater', 'haha']
       : ['I', ', ', 'you', '; ', 'a', '  ', 'seperater', '.   ', 'haha'] ['I', 'you', 'a', 'seperater', 'haha'] [', ', '; ', '  ', '.   ']
       
*** iterate on two lists, by first zip the two to one
    looks nice!
    #+begin_src python
    # Reform the line using the same delimiters
    ''.join(v+d for v,d in zip(values, delimiters))
    'asdf fjdk;afed,fjek,asdf,foo'
    #+end_src
    
    
*** regexp noncapture group, by r'(?:...)'
    
** 2.2. Matching Text at the Start or End of a String, by str.startswith() or str.endswith() method
   #+begin_src python
   filename = "aaaa.txt"
   filename.endswith(".txt")
   # pass a tuple to check against multiple choices
   filename.endswith((".c", ".h"))
   #+end_src
   
   #+begin_src python
   from urllib.request import urlopen
   def read_data(name):
       if name.startswith(('http:', 'https:', 'ftp:')):
           return urlopen(name).read()
       else:
           with open(name) as f:
               return f.read()
   #+end_src
   
   The parameter is simple string.
   
   Compared to re.match, str.startswith looks nice.
   
** 2.3. Matching Strings Using Shell Wildcard Patterns, with fnmatch.fnmatch(), fnmatch.fnmatchcase()
   Shell wildcard:
   - [] : a charset
   - * : match any length of chars
   - ? : match only one char
     
   #+begin_src python :results output
   from fnmatch import fnmatch
   print(fnmatch("data 1.txt", "*[0-9]*"))
   #+end_src
   
   #+RESULTS:
   : False
   
   1. the pattern must match the whole string
   2. compares to startswith(), fnmatch can match at any position
   3. compares to regexp, fnmatch looks nice
   4. fnmatch will use the same case-sensitive rule as the OS, fnmatchcase will always respect case.
   5. between simpe string and full power of regexp
      
      
** 2.4. Matching and Searching for Text Patterns
   What's  the difference between matching and searching
   
*** the str.find() function: find the start index of a substring
    #+begin_src python :results output
    s = "Hello xxx bbbb"
    print(s.find("xx"))
    #+end_src
    
    #+RESULTS:
    : 6
    
    
*** re.compile() function: compile a regexp strinng to a regexp object, for performance
    If you use the regexp many times, then first compile it is good. But if you only use it for one time, then don't use the compile function
    
*** difference between r'\d' and '\d'
    if the string is prefixed by  a 'r', then the '\' in the string will not be intepreted by the string parser.
    So the second regexp is actually r'd'.
    
