blog/2017/07/10/python-cookbook-readnote/index.html
<div class="outline-text-3" id="text-orgc5f91ee">
</div><div id="outline-container-org6dfb7ab" class="outline-4">
<h4 id="org6dfb7ab">the collections.nametuple function, map an index to a name, and access to an element with that name</h4>
<div class="outline-text-4" id="text-org6dfb7ab">
<p>
example:
</p>
<div class="org-src-container">
<pre class="src src-python">from collections import namedtuple
People =  namedtuple('People', ['name', 'age'])
p = People(name='Jim', age=12)
print(p, p.name, p.age)
</pre>
</div>

<p>
A good application:
for database selection.
</p>

<p>
The ._replace method:
Because a tuple is immutable, so to change an element, you can use _replace to  replace a field and a new one will be returned.
A tipical usage is first  create a prototype element with all field value be the default one, then update some fields with the <span class="underline">replace function.
Why there is a '</span>' in the function name?
</p>
<div class="org-src-container">
<pre class="src src-python">from collections import namedtuple
Stock = namedtuple('Stock', ['name', 'shares', 'price', 'date', 'time'])
# Create a prototype instance
stock_prototype = Stock('', 0, 0.0, None, None)
# Function to convert a dictionary to a Stock
def dict_to_stock(s):
    return stock_prototype._replace(**s)

a = {'name': 'ACME', 'shares': 100, 'price': 123.45}
dict_to_stock(a)
# Stock(name='ACME', shares=100, price=123.45, date=None, time=None)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org20384d0" class="outline-3">
<h3 id="org20384d0">1.19. Transforming and Reducing Data at the Same Time</h3>
<div class="outline-text-3" id="text-org20384d0">
<p>
use generator-expression argument
</p>

<p>
The reducing function means: given a list, return a value.
</p>
</div>
</div>
<div id="outline-container-orgd3cc70a" class="outline-3">
<h3 id="orgd3cc70a">the any function, check if any of an element is True in a iterable</h3>
<div class="outline-text-3" id="text-orgd3cc70a">
</div><div id="outline-container-orgdde511e" class="outline-4">
<h4 id="orgdde511e">check if  any .py files exist in a directory</h4>
<div class="outline-text-4" id="text-orgdde511e">
<div class="org-src-container">
<pre class="src src-python"># Determine if any .py files exist in a directory
import os
files = os.listdir('dirname')
if any(name.endswith('.py') for name in files):
    print('There be python!')
else:
    print('Sorry, no python.')
</pre>
</div>
</div>
</div>
<div id="outline-container-orgbc5bbc3" class="outline-4">
<h4 id="orgbc5bbc3">get all files in a directory as a list</h4>
<div class="outline-text-4" id="text-orgbc5bbc3">
<div class="org-src-container">
<pre class="src src-python">import os
files = os.listdir('dirname')
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc371c1a" class="outline-4">
<h4 id="orgc371c1a">change a tuple/list/iterable to a csv line</h4>
<div class="outline-text-4" id="text-orgc371c1a">
<p>
This is much better than the string format method
</p>
<div class="org-src-container">
<pre class="src src-python"># Output a tuple as CSV
s = ('ACME', 50, 123.45)
print(','.join(str(x) for x in s))# Output a tuple as CSV
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org4c77de6" class="outline-3">
<h3 id="org4c77de6">1.20. Combining Multiple Mappings into a Single Mapping</h3>
<div class="outline-text-3" id="text-org4c77de6">
</div><div id="outline-container-org3aae743" class="outline-4">
<h4 id="org3aae743">the collections.ChainMap</h4>
<div class="outline-text-4" id="text-org3aae743">
<p>
combining many maps/dictionaries, then when get an element, it will try to get from the first map, then the second, ...
</p>

<p>
And for operations that mutate the mapping always affect the first map/dictionary.
</p>

<p>
typical application:
scoped variable in a programming language.
</p>

<p>
Difference from the dict.update function:
ChainMap use a link to the original dictionary, while dict.update create a new one.
</p>
</div>
<ul class="org-ul"><li><a id="org73418fe"></a>check if an element exists in many dictionaries/maps, sequencially<br /><div class="outline-text-5" id="text-org73418fe">
<div class="org-src-container">
<pre class="src src-python">a = {'x': 1, 'z': 3 }
b = {'y': 2, 'z': 4 }
from collections import ChainMap
c = ChainMap(a,b)
print(c['x']) # Outputs 1 (from a)
print(c['y']) # Outputs 2 (from b)
print(c['z']) # Outputs 3 (from a)
</pre>
</div>
<ul class="org-ul">
<li>chapter 2: Strings and Text</li>
</ul>
</div></li></ul>
</div>
</div>
<div id="outline-container-org928f112" class="outline-3">
<h3 id="org928f112">2.1. Splitting Strings on Any of Multiple Delimiters</h3>
<div class="outline-text-3" id="text-org928f112">
<p>
By us re.split and the regexp is r'[,;\s]\s*'
</p>
</div>
<div id="outline-container-org9ccec78" class="outline-4">
<h4 id="org9ccec78">difference between str.split and re.split</h4>
<div class="outline-text-4" id="text-org9ccec78">
<p>
str.split only accept simple seperator
re.split accept regulare expression.
</p>
</div>
</div>
<div id="outline-container-orgae2a1d7" class="outline-4">
<h4 id="orgae2a1d7">return value of re.split</h4>
<div class="outline-text-4" id="text-orgae2a1d7">
<ol class="org-ol">
<li>if there are no capture group, then the same as str.split</li>
<li><p>
if there are capture group, then all matched data will also be returned.
then the value will be rst[::2], the seperator will be rst[1::2]
</p>
<div class="org-src-container">
<pre class="src src-python">s = "I, you; a  seperater.   haha"
import re
a = re.split(r'[,;.\s]\s*', s)
print(a)

a = re.split(r'([,;.\s]\s*)',s)
print(a, a[::2], a[1::2])
</pre>
</div></li>
</ol>
</div>
</div>

<div id="outline-container-orgaa6c5d6" class="outline-4">
<h4 id="orgaa6c5d6">iterate on two lists, by first zip the two to one</h4>
<div class="outline-text-4" id="text-orgaa6c5d6">
<p>
looks nice!
</p>
<div class="org-src-container">
<pre class="src src-python"># Reform the line using the same delimiters
''.join(v+d for v,d in zip(values, delimiters))
'asdf fjdk;afed,fjek,asdf,foo'
</pre>
</div>
</div>
</div>


<div id="outline-container-org31232a7" class="outline-4">
<h4 id="org31232a7">regexp noncapture group, by r'(?:...)'</h4>
</div>
</div>

<div id="outline-container-org224eed8" class="outline-3">
<h3 id="org224eed8">2.2. Matching Text at the Start or End of a String, by str.startswith() or str.endswith() method</h3>
<div class="outline-text-3" id="text-org224eed8">
<div class="org-src-container">
<pre class="src src-python">filename = "aaaa.txt"
filename.endswith(".txt")
# pass a tuple to check against multiple choices
filename.endswith((".c", ".h"))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python">from urllib.request import urlopen
def read_data(name):
    if name.startswith(('http:', 'https:', 'ftp:')):
        return urlopen(name).read()
    else:
        with open(name) as f:
            return f.read()
</pre>
</div>

<p>
The parameter is simple string.
</p>

<p>
Compared to re.match, str.startswith looks nice.
</p>
</div>
</div>

<div id="outline-container-orgd5381f3" class="outline-3">
<h3 id="orgd5381f3">2.3. Matching Strings Using Shell Wildcard Patterns, with fnmatch.fnmatch(), fnmatch.fnmatchcase()</h3>
<div class="outline-text-3" id="text-orgd5381f3">
<p>
Shell wildcard:
</p>
<ul class="org-ul">
<li>[] : a charset</li>
<li>* : match any length of chars</li>
<li>? : match only one char</li>
</ul>

<div class="org-src-container">
<pre class="src src-python">from fnmatch import fnmatch
print(fnmatch("data 1.txt", "*[0-9]*"))
</pre>
</div>

<ol class="org-ol">
<li>the pattern must match the whole string</li>
<li>compares to startswith(), fnmatch can match at any position</li>
<li>compares to regexp, fnmatch looks nice</li>
<li>fnmatch will use the same case-sensitive rule as the OS, fnmatchcase will always respect case.</li>
<li>between simpe string and full power of regexp</li>
</ol>
</div>
</div>


<div id="outline-container-orgb345221" class="outline-3">
<h3 id="orgb345221">2.4. Matching and Searching for Text Patterns</h3>
<div class="outline-text-3" id="text-orgb345221">
<p>
What's  the difference between matching and searching
</p>
</div>

<div id="outline-container-org03865c0" class="outline-4">
<h4 id="org03865c0">the str.find() function: find the start index of a substring</h4>
<div class="outline-text-4" id="text-org03865c0">
<div class="org-src-container">
<pre class="src src-python">s = "Hello xxx bbbb"
print(s.find("xx"))
</pre>
</div>
</div>
</div>


<div id="outline-container-orgb008785" class="outline-4">
<h4 id="orgb008785">re.compile() function: compile a regexp strinng to a regexp object, for performance</h4>
<div class="outline-text-4" id="text-orgb008785">
<p>
If you use the regexp many times, then first compile it is good. But if you only use it for one time, then don't use the compile function
</p>
</div>
</div>

<div id="outline-container-org8d5578c" class="outline-4">
<h4 id="org8d5578c">difference between r'\d' and '\d'</h4>
<div class="outline-text-4" id="text-org8d5578c">
<p>
if the string is prefixed by  a 'r', then the '\' in the string will not be intepreted by the string parser.
So the second regexp is actually r'd'.
</p>
</div>
</div>
