blog/2017/07/10/python-cookbook-readnote/index.html

<div id="outline-container-orgdccbf1c" class="outline-4">
<h4 id="orgdccbf1c">re.findall() function, find all matched data as a list</h4>
<div class="outline-text-4" id="text-orgdccbf1c">
<div class="org-src-container">
<pre class="src src-python">text = 'Today is 11/27/2012. PyCon starts 3/13/2013.'
import re
rg = r'\d+/(?:\d+)/(?:\d+)'
a = re.match('Today', text)
print(a.group(0))
a = re.findall(rg, text)
print(a)
print(type(a[0]))
</pre>
</div>

<p>
The return value: if there are capture groups, then the return value is the captured data, and if the capture group number is one, it will be  a string, else be  a tuple of strings.
if  no capture groups, then the return value is all matched  data.
</p>
</div>
</div>

<div id="outline-container-org64b17ff" class="outline-4">
<h4 id="org64b17ff">re.finditer(), find all matched data as a iterater</h4>
<div class="outline-text-4" id="text-org64b17ff">
<p>
Seems the return value is different from re.findall(), it will return a  matched object , the same as re.match()
Seems strange, and highly inconsistent.
</p>
</div>
</div>

<div id="outline-container-orgad26c58" class="outline-4">
<h4 id="orgad26c58">re.match() function, always match at the start of a string</h4>
</div>
<div id="outline-container-org188af14" class="outline-4">
<h4 id="org188af14">re.match() function, return value</h4>
<div class="outline-text-4" id="text-org188af14">
<p>
rst.group(0): the matched data
rst.group(1): the first captured data
rst.groups(): all captured data as a tuple
</p>
</div>
</div>
</div>

<div id="outline-container-org40e1aae" class="outline-3">
<h3 id="org40e1aae">2.5. Searching and Replacing Text</h3>
<div class="outline-text-3" id="text-org40e1aae">
</div><div id="outline-container-orgc426346" class="outline-4">
<h4 id="orgc426346">the str.replace function, replace all occurence in a string</h4>
<div class="outline-text-4" id="text-orgc426346">
<p>
str.replcae(pattern, replacement)
</p>
<div class="org-src-container">
<pre class="src src-python">text = 'yeah, but no, but yeah, but no, but yeah'
print(text.replace('yeah', 'yep'))
# 'yep, but no, but yep, but no, but yep'
</pre>
</div>
</div>
</div>

<div id="outline-container-org4a0822f" class="outline-4">
<h4 id="org4a0822f">the re.sub(pattern, replacement, text) function, will also replace all occurence in a string</h4>
<div class="outline-text-4" id="text-org4a0822f">
<p>
use r'\1' to refer to the first captured group
</p>
<div class="org-src-container">
<pre class="src src-python">text = 'Today is 11/27/2012. PyCon starts 3/13/2013.'
import re
print(re.sub(r'(\d+)/(\d+)/(\d+)', r'\3-\1-\2', text))
# 'Today is 2012-11-27. PyCon starts 2013-3-13.'
</pre>
</div>
</div>
</div>

<div id="outline-container-org122d0ac" class="outline-4">
<h4 id="org122d0ac">the re.sub(pattern, callback, text) function, will also replace all occurence in a string</h4>
<div class="outline-text-4" id="text-org122d0ac">
<p>
The second parameter can also be a function, the parameter to this function is a match object(the  same returned by re.match function).
</p>

<p>
The same example as the above one:
</p>
<div class="org-src-container">
<pre class="src src-python">text = 'Today is 11/27/2012. PyCon starts 3/13/2013.'
import re
def foo(m):
    (m, d, y) = m.groups()
    return '-'.join([y,m,d])

print(re.sub(r'(\d+)/(\d+)/(\d+)', foo, text))
</pre>
</div>
</div>
</div>


<div id="outline-container-orgfbc428a" class="outline-4">
<h4 id="orgfbc428a">the re.subn(...) function, same as re.sub, but also return subsitution counts also</h4>
</div>
</div>
<div id="outline-container-orgfd59790" class="outline-3">
<h3 id="orgfd59790">2.6. Searching and Replacing Case-Insensitive Text</h3>
<div class="outline-text-3" id="text-orgfd59790">
<p>
To do case-insensitive operations, you must use regexp with the re.IGNORECASE flags keyword parameter
</p>
</div>

<div id="outline-container-orgddfa01a" class="outline-4">
<h4 id="orgddfa01a">replace words in a string with original case preserved</h4>
<div class="outline-text-4" id="text-orgddfa01a">
<p>
a excenlent example of replacing with 原始的大小写规则. 并且是一个很好的高阶函数的例子。
</p>
<div class="org-src-container">
<pre class="src src-python">def matchcase(word):
    def replace(m):
        text = m.group()
        if text.isupper():
            return word.upper()
        elif text.islower():
            return word.lower()
        elif text[0].isupper():
            return word.capitalize()
        else:
            return word

    return replace

text = 'UPPER PYTHON, lower python, Mixed Python'
import re
print(re.sub('python', matchcase('snake'), text, flags=re.IGNORECASE))
# 'UPPER SNAKE, lower snake, Mixed Snake'
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgee3c6f4" class="outline-3">
<h3 id="orgee3c6f4">2.7. Specifying a Regular Expression(regexp) for the Shortest Match, by using modifier '?', no-greedy match</h3>
<div class="outline-text-3" id="text-orgee3c6f4">
<p>
By default, * will match longest data. if appended with a '?' then it will match the shortest
</p>

<div class="org-src-container">
<pre class="src src-python">import re
text1 = 'Computer says "no."'
r= re.findall(r'"(.*)"', text1)
print(r)

text2 = 'Computer says "no." Phone says "yes."'
r= re.findall(r'"(.*)"', text2)
print(r)

# Now add a '?' after '*', no greedy match
r= re.findall(r'"(.*?)"', text2)
print(r)
</pre>
</div>
</div>
</div>

<div id="outline-container-org8cf4c3c" class="outline-3">
<h3 id="org8cf4c3c">2.8. Writing a Regular Expression for Multiline Patterns</h3>
<div class="outline-text-3" id="text-org8cf4c3c">
<p>
By default, '.' will not match a new line character. 
there are two choices to let '.' match a new line character:
</p>
<ol class="org-ol">
<li>by alternative.
change r'.*' to r'(?:.|\n)*'</li>
<li><p>
by use the re.DOTALL flag
</p>
<div class="org-src-container">
<pre class="src src-python">s = '''/* aaaa
bbbb
cccc */'''
import re
r = re.findall(r'/\*.*\*/', s, flags=re.DOTALL)
r = re.findall(r'/\*(?:.|\n)*\*/', s, flags=re.DOTALL)
print(r)
</pre>
</div></li>
</ol>
</div>

<div id="outline-container-org18e538f" class="outline-4">
<h4 id="org18e538f">the re.DOTALL flag: let '.' match a newline character</h4>
</div>
</div>
<div id="outline-container-orgbdd14e1" class="outline-3">
<h3 id="orgbdd14e1">2.9. Normalizing Unicode Text to a Standard Representation, by unicodedata.normalize('NFC', str)</h3>
<div class="outline-text-3" id="text-orgbdd14e1">
<p>
unicode may have more than one representation, see example in the book
</p>
</div>
<div id="outline-container-org328b2d6" class="outline-4">
<h4 id="org328b2d6">normalizing means make sth. has the uniform format/type</h4>
</div>
</div>
<div id="outline-container-orgbe094b4" class="outline-3">
<h3 id="orgbe094b4">2.11. Stripping Unwanted Characters from Strings</h3>
<div class="outline-text-3" id="text-orgbe094b4">
</div><div id="outline-container-org2831f9e" class="outline-4">
<h4 id="org2831f9e">str.strip() function. lstrip(), rstrip(), delete whitespaces characters at begining or ending</h4>
<div class="outline-text-4" id="text-org2831f9e">
<div class="org-src-container">
<pre class="src src-python">s = "    a b c \n ";
print(s.strip())
print(s.lstrip())
print(s.rstrip())
</pre>
</div>
<p>
<b>*</b> delete characters in middle of string, by str.replace(), or re.sub()
</p>
<div class="org-src-container">
<pre class="src src-python">s = "   hello     word    ";
print(s.replace(" ", ""))
import re
print(re.sub("\s+", " ", s))
</pre>
</div>
<p>
<b>*</b> create a generator object  by an expression, by '(' instead of '[', like lazy evaluation on other languages
</p>
<div class="org-src-container">
<pre class="src src-python">s = '''
import os.path
rst = ""
if os.path.isfile(""):
    with open("", "r") as f:
        rst = f.read()
'''
ss = s.split("\n")

s1 = (s.strip() for s in ss)
print(s1)
for s in s1:
    print(s)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgf2a9242" class="outline-3">
<h3 id="orgf2a9242">2.12. Sanitizing and Cleaning Up Text</h3>
<div class="outline-text-3" id="text-orgf2a9242">
</div><div id="outline-container-org6b5319f" class="outline-4">
<h4 id="org6b5319f">str.translate() function, change characters given a table/dictionary, the book given much unicode examples</h4>
</div>
</div>

<div id="outline-container-orga4b5812" class="outline-3">
<h3 id="orga4b5812">2.13. Aligning Text Strings</h3>
<div class="outline-text-3" id="text-orga4b5812">
</div><div id="outline-container-org87b5b0e" class="outline-4">
<h4 id="org87b5b0e">the str.ljust(), str.rjust(), str.center() functions</h4>
<div class="outline-text-4" id="text-org87b5b0e">
<p>
accept a number, and an optionall character
</p>
<div class="org-src-container">
<pre class="src src-python">print("aaa".ljust(20, "b"))
print("aaa".rjust(20, "-"))
print("aaa".center(20, "="))
print("aaa".center(20))
</pre>
</div>
</div>
</div>
