blog/2017/07/10/python-cookbook-readnote/index.html

<div id="outline-container-org8cd829b" class="outline-4">
<h4 id="org8cd829b">the format function and the str.format methods</h4>
<div class="outline-text-4" id="text-org8cd829b">
<div class="org-src-container">
<pre class="src src-python">print(format("aaa", "&gt;20")) # same as rjust
print(format("aaa", "=&lt;20")) # same as ljust
print(format("aaa", "^20")) # same as center
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python">print("{} {:=^10}".format("abc", 123))
</pre>
</div>





<p>
"%s %s" % (a, b) is old way, now should use the new way.
</p>
</div>
</div>
</div>


<div id="outline-container-org2e01831" class="outline-3">
<h3 id="org2e01831">2.14. Combining and Concatenating Strings</h3>
<div class="outline-text-3" id="text-org2e01831">
</div><div id="outline-container-org264a37f" class="outline-4">
<h4 id="org264a37f">by str.join</h4>
</div>

<div id="outline-container-org1a38ad4" class="outline-4">
<h4 id="org1a38ad4">by + operator</h4>
</div>

<div id="outline-container-org54ec4e6" class="outline-4">
<h4 id="org54ec4e6">by print function's 'sep' parameter</h4>
</div>

<div id="outline-container-org714601a" class="outline-4">
<h4 id="org714601a">by format function</h4>
</div>
</div>
<div id="outline-container-org5c17208" class="outline-3">
<h3 id="org5c17208">2.15. Interpolating Variables in Strings, by str.format() or str.format_map() method</h3>
<div class="outline-text-3" id="text-org5c17208">
<p>
Note: format_map doesn't exist in python 2.7
</p>
<div class="org-src-container">
<pre class="src src-python">print("{name} is {age} years old".format(name="Tom", age=16))

name = "Jim"
age = 18
# print("{name} is {age} years old".format_map(vars()))
</pre>
</div>


<p>
format_map accept a dictionay, while format accept keywords parameters
</p>
</div>
<div id="outline-container-org3b589ad" class="outline-4">
<h4 id="org3b589ad">the vars() function, the same as locals() if no parameter</h4>
<div class="outline-text-4" id="text-org3b589ad">
<p>
if pass one parameter, then it is the same as obj.__dict__
</p>
<div class="org-src-container">
<pre class="src src-python">s = 'abc'
d = 123
print(vars())
print(locals())
# print(vars(s))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb0be68b" class="outline-4">
<h4 id="orgb0be68b">the dict.__missing__(self, key) method will be called when a key not exists, then KeyError will not be raised.</h4>
<div class="outline-text-4" id="text-orgb0be68b">
<p>
If this method is defined, then when a key not exists, it will be called and return the value. Else a KeyError will be raised.
</p>
<div class="org-src-container">
<pre class="src src-python">class safedict(dict):
    def __missing__(self, key):
        return '{'+key+'}'

d = safedict();
print(d['name'])
d1 = dict();
# print(d1['name'])
</pre>
</div>
</div>
</div>
<div id="outline-container-org8b92d60" class="outline-4">
<h4 id="org8b92d60">a function that will do variable interpolating from env, just like $var in perl, by str.format_map</h4>
<div class="outline-text-4" id="text-org8b92d60">
<div class="org-src-container">
<pre class="src src-python">class safedict(dict):
    def __missing__(self, key):
        return '{'+key+'}'


import sys
def sub(text):
    return text.format_map(safedict(sys._getframe(1).f_locals))

name="Jim"
age=18
print(sub("{name} is {age} years old"))
</pre>
</div>


<div class="org-src-container">
<pre class="src src-python">people = {
   'name': ['John', 'Peter'],
   'age': [56, 64]
}

for i in range(2):
    print('My name is {{name[{0}]}}, I am {{age[{0}]}} years old.'.format(i).format_map(people))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf0f29a9" class="outline-4">
<h4 id="orgf0f29a9">sys._getframe([depth]): like calls in perl, get the stack frame</h4>
<div class="outline-text-4" id="text-orgf0f29a9">
<p>
depth default to 0, means current stack frame. 
f_locals attribute is used to get all local variabls.
f_lineno attribute is the line number.
</p>
<div class="org-src-container">
<pre class="src src-python">import sys
print(sys._getframe().f_locals)
print(sys._getframe().f_globals)
print(dir(sys._getframe().f_code))
print(sys._getframe().f_code.co_filename)
print(sys._getframe().f_lineno)
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-orga5736dd" class="outline-3">
<h3 id="orga5736dd">2.16. Reformatting Text to a Fixed Number of Columns, by textwrap.fill(astr, columns, initial_indent='', subsquent_indent='')</h3>
<div class="outline-text-3" id="text-orga5736dd">
<div class="org-src-container">
<pre class="src src-python">import textwrap
s = "Look into my eyes, look into my eyes, the eyes, the eyes, \
the eyes, not around the eyes, don't look around the eyes, \
look into my eyes, you're under."

print(s)
print(textwrap.fill(s, 60))
</pre>
</div>
</div>

<div id="outline-container-orgd6d5cb3" class="outline-4">
<h4 id="orgd6d5cb3">get terminal column size, by os.get_terminal_size().columns</h4>
<div class="outline-text-4" id="text-orgd6d5cb3">
<div class="org-src-container">
<pre class="src src-python">import os
print(os.get_terminal_size().columns)
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-org649bca3" class="outline-3">
<h3 id="org649bca3">2.17. Handling HTML and XML Entities in Text</h3>
<div class="outline-text-3" id="text-org649bca3">
</div><div id="outline-container-org074cc0b" class="outline-4">
<h4 id="org074cc0b">the html.escape(astr, quote=True) function:</h4>
<div class="outline-text-4" id="text-org074cc0b">
<p>
escape means convert special characters to 
</p>
<div class="org-src-container">
<pre class="src src-python">s = '&lt;a&gt;this is &lt;/a&gt;'
import html
print(html.escape(s))
</pre>
</div>
</div>
</div>
<div id="outline-container-org5688323" class="outline-4">
<h4 id="org5688323">the str.encode('ascii', errors='xmlcharrefreplace') function: encode a string to ascii</h4>
<div class="outline-text-4" id="text-org5688323">
<div class="org-src-container">
<pre class="src src-python">s = 'Spicy Jalapeño'
print(s.encode('ascii', errors='xmlcharrefreplace'))
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-orgc7a67f2" class="outline-2">
<h2 id="orgc7a67f2">chapter 4: Iterators and Generators</h2>
<div class="outline-text-2" id="text-orgc7a67f2">
</div><div id="outline-container-org589c74e" class="outline-3">
<h3 id="org589c74e">4.1. Manually Consuming an Iterator, by next(iterator[, default]) function</h3>
<div class="outline-text-3" id="text-org589c74e">
<div class="org-src-container">
<pre class="src src-python">with open('python-cookbook-3rd.org') as f:
    print(next(f))
</pre>
</div>
</div>

<div id="outline-container-org560d5a3" class="outline-4">
<h4 id="org560d5a3">open(filename, ...) function will return a iterator of lines in that file</h4>
</div>
<div id="outline-container-org7ccd7f7" class="outline-4">
<h4 id="org7ccd7f7">a list object is not an iterator</h4>
</div>
<div id="outline-container-org2ef04bf" class="outline-4">
<h4 id="org2ef04bf">use the iter(iterable) function to create an iterator given an iterable</h4>
</div>
<div id="outline-container-org0ad7fca" class="outline-4">
<h4 id="org0ad7fca">the for x in X syntax works both for iterator and list object</h4>
</div>
</div>
