blog/python-cookbook-readnote.org
** iterator and iterable
   An object is said to be iterable if it has the __iter__ method defined.
   The __iter__() will reutrn the iterator object.
   
   An object is said to be a iterator if it has following method defined:
   1. __iter__: which return itself
      Can be tested the it.__iter__() == it is true
   2. __next__: return the next value every time it is invoked. 
   

   So an iterator is an iterable,  call iter(iterable) to get an iterator.

   
   The iter(iterable) function: 
   it will return 'iterable.__iter__()'


   So if obja is an iterable, then iter(obja) equal obja.__iter() 
   #+begin_src python :results output
   obja = [1, 2, 3]
   ia = obja.__iter__()
   ib = iter(obja)
   ic = iter(ib)
   print(ia)
   print(ib)
   print(ib is ic)
   print(next(ia), next(ib))
   #+end_src

   #+RESULTS:
   : <list_iterator object at 0x0000001303C5CF98>
   : <list_iterator object at 0x0000001303C5CF28>
   : True
   : 1 1

   if obja is iterator, then iter(obja) and obja is the same object.


   A good ref: http://www.shutupandship.com/2012/01/understanding-python-iterables-and.html
*** a example of create a iterable class
    #+begin_src python :results output
    class MyList(list):
        def __iter__(self):
            return MyListIter(self)
        
    class MyListIter(object):
        """ A sample implementation of a list iterator. NOTE: This is just a 
        demonstration of concept!!! YOU SHOULD NEVER IMPLEMENT SOMETHING LIKE THIS!
        Even if you have to (for any reason), there are many better ways to 
        implement this."""
        def __init__(self, lst):
            self.lst = lst
            self.i = -1
        def __iter__(self):
            return self
        def __next__(self):
            if self.i<len(self.lst)-1:
                self.i += 1         
                return self.lst[self.i]
            else:
                raise StopIteration

    if __name__ == '__main__':
        a = MyList([1, 2, 3, 4])
        ia = iter(a)
        print('type(a): %r, type(ia): %r' %(type(a), type(ia)))
        for i in a: 
            print (i)
    #+end_src

    #+RESULTS:
    : type(a): <class '__main__.MyList'>, type(ia): <class '__main__.MyListIter'>
    : 1
    : 2
    : 3
    : 4

** how does the for in loop works
   1. it first get the iterable's iterator object, by calling its __iter__() method
   2. get the element by invoke the iterator's __next__() method, and bind the value to the variable.
   3. stop when an 'StopIteration' exception happens.
** the next(iterator) function
   it just return iterator.__next__()
** the iter(iterable) function
   it just return iterable.__iter__()
** the len(obj) function
   it just return obj.__len__()
** 4.2. Delegating Iteration
   When create a class the with a underline container, just define an __iter__() method that forward the request to the underlineing container object.

** 4.3. Creating New Iteration Patterns with Generators
** what is a generator?
   a generator is a function that contains at lease one 'yeild' statement.

   Unlike normal function, it's boyd will not be executed when it is be called, instead, it will return a generator object.
** 4.4. Implementing the Iterator Protocol
   use the generator instead of the __next__ method, which will be much simple.

   使用yeild 创建一个Tree Node,比使用__next__函数简单多了。

   yeild from syntax.
** 4.5. Iterating in Reverse, by the reversed(obj) function
   reversed only  works if the obj
   - the obj defined a __reversed__() method. or
   - the obj's size can be determined.
     

   It returns an iterator.

   For example, a file handler returned by the 'open()' function can't be used with the reversed function. to use it, first convert it to a list, then pass it to the reversed() function.
   #+begin_src python :results output
   with open("1.txt") as f:
       a = reversed(list(f))
       print(next(a), next(a))
   #+end_src

   #+RESULTS:
   : cccc 
   : 
** defined a customized  reversed iterator, by define the __reversed__() method
   #+begin_src python :results output
   class CountDown():
       def __init__(self, start):
           self._start = start

       def __iter__(self):
           return self

       def __next__(self):
           if self._start >=0:
               n = self._start
               self._start -= 1
               return n
           else:
               raise StopIteration

       def __reversed__(self):
           return ReversedCountDown(self)

   class ReversedCountDown():
       def __init__(self, orig):
           self._orig = orig
           self._n = -1
       def  __iter__(self):
           return self
       def __next__(self):
           if self._n <= self._orig._start:
               self._n += 1
               return self._n
           else:
               raise StopIteration

   # if __name__ == '__main__':
   cd = CountDown(2)
   # for a in cd:
   #     print(a)

   print("reversed")
   for a in reversed(cd):
       print(a)
   #+end_src

   #+RESULTS:
   : reversed
   : 0
   : 1
   : 2
   : 3


   Implemet the iterator protocal by __next__ method is a little complex compared  to by  use the yield statement. The differenc is that then the object is ... 

   #+begin_src python :results output
   class CountDown():
       def __init__(self, start):
           self._start = start

       def __iter__(self):
           n = self._start
           while n >=0:
               yield n
               n -=1

       def __reversed__(self):
           n = 0
           while n <=self._start:
               yield n
               n+=1

   cd = CountDown(3)
   for a in cd:
       print(a)

   print ("reversed")
   for a in reversed(cd):
       print(a)
   #+end_src

   #+RESULTS:
   : 3
   : 2
   : 1
   : 0
   : reversed
   : 0
   : 1
   : 2
   : 3


** 4.6. Defining Generator Functions with Extra State
*** print the surrounding previous lines if pattern matched, by use a generator, implemented by a class
    Here previous lines are states.
    #+begin_src python :results output
    from collections import deque
    class HistoryLines():
        def __init__(self, lines, histlen=3):
            self.lines = lines
            self.history = deque(maxlen=histlen)

        def __iter__(self):
            for line in self.lines:
                self.history.append(line)
                yield line

    with open('1.txt') as f:
        hist_lines = HistoryLines(f)
        for line in hist_lines:
            if  'wrap' in line:
                for hl in hist_lines.history:
                    print('%s' % hl)
    #+end_src

    #+RESULTS:
    : bbbb
    : 
    : EEEXXX
    : 
    : a wrap  bbb
    : 

    Good practice: if you need save some states, then don't use a function to create a generator, use a class.

** 4.7. Taking a Slice of an Iterator
