blog/2017/07/10/python-cookbook-readnote/index.html
<div id="outline-container-org423182e" class="outline-3">
<h3 id="org423182e">iterator and iterable</h3>
<div class="outline-text-3" id="text-org423182e">
<p>
An object is said to be iterable if it has the <span class="underline"><span class="underline">iter</span></span> method defined.
The __iter__() will reutrn the iterator object.
</p>

<p>
An object is said to be a iterator if it has following method defined:
</p>
<ol class="org-ol">
<li>__iter__: which return itself
Can be tested the it.__iter__() == it is true</li>
<li>__next__: return the next value every time it is invoked.</li>
</ol>


<p>
So an iterator is an iterable,  call iter(iterable) to get an iterator.
</p>


<p>
The iter(iterable) function: 
it will return 'iterable.__iter__()'
</p>


<p>
So if obja is an iterable, then iter(obja) equal obja.__iter() 
</p>
<div class="org-src-container">
<pre class="src src-python">obja = [1, 2, 3]
ia = obja.__iter__()
ib = iter(obja)
ic = iter(ib)
print(ia)
print(ib)
print(ib is ic)
print(next(ia), next(ib))
</pre>
</div>

<p>
if obja is iterator, then iter(obja) and obja is the same object.
</p>


<p>
A good ref: <a href="http://www.shutupandship.com/2012/01/understanding-python-iterables-and.html">http://www.shutupandship.com/2012/01/understanding-python-iterables-and.html</a>
</p>
</div>
<div id="outline-container-org5e82dcc" class="outline-4">
<h4 id="org5e82dcc">a example of create a iterable class</h4>
<div class="outline-text-4" id="text-org5e82dcc">
<div class="org-src-container">
<pre class="src src-python">class MyList(list):
    def __iter__(self):
        return MyListIter(self)

class MyListIter(object):
    """ A sample implementation of a list iterator. NOTE: This is just a 
    demonstration of concept!!! YOU SHOULD NEVER IMPLEMENT SOMETHING LIKE THIS!
    Even if you have to (for any reason), there are many better ways to 
    implement this."""
    def __init__(self, lst):
        self.lst = lst
        self.i = -1
    def __iter__(self):
        return self
    def __next__(self):
        if self.i&lt;len(self.lst)-1:
            self.i += 1         
            return self.lst[self.i]
        else:
            raise StopIteration

if __name__ == '__main__':
    a = MyList([1, 2, 3, 4])
    ia = iter(a)
    print('type(a): %r, type(ia): %r' %(type(a), type(ia)))
    for i in a: 
        print (i)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgb993845" class="outline-3">
<h3 id="orgb993845">how does the for in loop works</h3>
<div class="outline-text-3" id="text-orgb993845">
<ol class="org-ol">
<li>it first get the iterable's iterator object, by calling its __iter__() method</li>
<li>get the element by invoke the iterator's __next__() method, and bind the value to the variable.</li>
<li>stop when an 'StopIteration' exception happens.</li>
</ol>
</div>
</div>
<div id="outline-container-org0bc1170" class="outline-3">
<h3 id="org0bc1170">the next(iterator) function</h3>
<div class="outline-text-3" id="text-org0bc1170">
<p>
it just return iterator.__next__()
</p>
</div>
</div>
<div id="outline-container-org7537a8f" class="outline-3">
<h3 id="org7537a8f">the iter(iterable) function</h3>
<div class="outline-text-3" id="text-org7537a8f">
<p>
it just return iterable.__iter__()
</p>
</div>
</div>
<div id="outline-container-orge7f9707" class="outline-3">
<h3 id="orge7f9707">the len(obj) function</h3>
<div class="outline-text-3" id="text-orge7f9707">
<p>
it just return obj.__len__()
</p>
</div>
</div>
<div id="outline-container-org32ddfce" class="outline-3">
<h3 id="org32ddfce">4.2. Delegating Iteration</h3>
<div class="outline-text-3" id="text-org32ddfce">
<p>
When create a class the with a underline container, just define an __iter__() method that forward the request to the underlineing container object.
</p>
</div>
</div>

<div id="outline-container-org2755ff1" class="outline-3">
<h3 id="org2755ff1">4.3. Creating New Iteration Patterns with Generators</h3>
</div>
<div id="outline-container-org90381b3" class="outline-3">
<h3 id="org90381b3">what is a generator?</h3>
<div class="outline-text-3" id="text-org90381b3">
<p>
a generator is a function that contains at lease one 'yeild' statement.
</p>

<p>
Unlike normal function, it's boyd will not be executed when it is be called, instead, it will return a generator object.
</p>
</div>
</div>
<div id="outline-container-org63711a7" class="outline-3">
<h3 id="org63711a7">4.4. Implementing the Iterator Protocol</h3>
<div class="outline-text-3" id="text-org63711a7">
<p>
use the generator instead of the <span class="underline"><span class="underline">next</span></span> method, which will be much simple.
</p>

<p>
使用yeild 创建一个Tree Node,比使用__next__函数简单多了。
</p>

<p>
yeild from syntax.
</p>
</div>
</div>
<div id="outline-container-orgdc2f2e6" class="outline-3">
<h3 id="orgdc2f2e6">4.5. Iterating in Reverse, by the reversed(obj) function</h3>
<div class="outline-text-3" id="text-orgdc2f2e6">
<p>
reversed only  works if the obj
</p>
<ul class="org-ul">
<li>the obj defined a __reversed__() method. or</li>
<li>the obj's size can be determined.</li>
</ul>


<p>
It returns an iterator.
</p>

<p>
For example, a file handler returned by the 'open()' function can't be used with the reversed function. to use it, first convert it to a list, then pass it to the reversed() function.
</p>
<div class="org-src-container">
<pre class="src src-python">with open("1.txt") as f:
    a = reversed(list(f))
    print(next(a), next(a))
</pre>
</div>
</div>
</div>
<div id="outline-container-org72b5912" class="outline-3">
<h3 id="org72b5912">defined a customized  reversed iterator, by define the __reversed__() method</h3>
<div class="outline-text-3" id="text-org72b5912">
<div class="org-src-container">
<pre class="src src-python">class CountDown():
    def __init__(self, start):
        self._start = start

    def __iter__(self):
        return self

    def __next__(self):
        if self._start &gt;=0:
            n = self._start
            self._start -= 1
            return n
        else:
            raise StopIteration

    def __reversed__(self):
        return ReversedCountDown(self)

class ReversedCountDown():
    def __init__(self, orig):
        self._orig = orig
        self._n = -1
    def  __iter__(self):
        return self
    def __next__(self):
        if self._n &lt;= self._orig._start:
            self._n += 1
            return self._n
        else:
            raise StopIteration

# if __name__ == '__main__':
cd = CountDown(2)
# for a in cd:
#     print(a)

print("reversed")
for a in reversed(cd):
    print(a)
</pre>
</div>


<p>
Implemet the iterator protocal by <span class="underline"><span class="underline">next</span></span> method is a little complex compared  to by  use the yield statement. The differenc is that then the object is ... 
</p>

<div class="org-src-container">
<pre class="src src-python">class CountDown():
    def __init__(self, start):
        self._start = start

    def __iter__(self):
        n = self._start
        while n &gt;=0:
            yield n
            n -=1

    def __reversed__(self):
        n = 0
        while n &lt;=self._start:
            yield n
            n+=1

cd = CountDown(3)
for a in cd:
    print(a)

print ("reversed")
for a in reversed(cd):
    print(a)
</pre>
</div>
</div>
</div>


<div id="outline-container-orgaaed3d7" class="outline-3">
<h3 id="orgaaed3d7">4.6. Defining Generator Functions with Extra State</h3>
<div class="outline-text-3" id="text-orgaaed3d7">
</div><div id="outline-container-org2d580c9" class="outline-4">
<h4 id="org2d580c9">print the surrounding previous lines if pattern matched, by use a generator, implemented by a class</h4>
<div class="outline-text-4" id="text-org2d580c9">
<p>
Here previous lines are states.
</p>
<div class="org-src-container">
<pre class="src src-python">from collections import deque
class HistoryLines():
    def __init__(self, lines, histlen=3):
        self.lines = lines
        self.history = deque(maxlen=histlen)

    def __iter__(self):
        for line in self.lines:
            self.history.append(line)
            yield line

with open('1.txt') as f:
    hist_lines = HistoryLines(f)
    for line in hist_lines:
        if  'wrap' in line:
            for hl in hist_lines.history:
                print('%s' % hl)
</pre>
</div>

<p>
Good practice: if you need save some states, then don't use a function to create a generator, use a class.
</p>
</div>
</div>
</div>

<div id="outline-container-orgdb9b193" class="outline-3">
<h3 id="orgdb9b193">4.7. Taking a Slice of an Iterator</h3>
