blog/python-cookbook-readnote.org
*** by use of the itertools.islice(start, end, step) functon
    Because we don't know the size of a iterator or a generator, so we can't slice it directly.
    #+begin_src python :results output
    from  itertools import islice as slice_iter
    a = range(8)
    for b  in slice_iter(iter(a), 2, 5, 1):
        print(b)

    with open('1.txt') as f:
        for line in slice_iter(f, 2, 5, 2):
            print(line.strip())
    #+end_src

    #+RESULTS:
    : 2
    : 3
    : 4
    : dd
    : bbbb

    The result is the  same as my impllemented one.

***   a try by me,  works
    #+begin_src python :results output
    def slice_iter(aiter, start, end, step):
        n = 0
        idx = range(end)[start:end:step]
        for i in range(end):
            v = next(aiter)
            if i in idx:
                yield v

    a = range(8)
    for b  in slice_iter(iter(a), 2, 5, 1):
        print(b)

    with open('1.txt') as f:
        for line in slice_iter(f, 2, 5, 2):
            print(line.strip())
    #+end_src

    #+RESULTS:
    : 2
    : 3
    : 4
    : dd
    : bbbb

** 4.8. Skipping the First Part of an Iterable, by itertools.dropwhile(test_func, iterable)
   #+begin_src python :results output
   import itertools
   with open('1.txt') as f:
       for line in itertools.dropwhile(lambda x: x.startswith('#'), f):
           print(line, end='')
   #+end_src

   #+RESULTS:
   : aaaa
   : # bbbb
   : EEEXXX
   : a wrap  bbb
   : dddd

   This is different from filtering

   if the position is known, then we can use itertools.islice(iterable, start, None) to drop the first 'start' items.
   

** 4.9. Iterating Over All Possible Combinations or Permutations
   An important aspect  of itertools module: for complex iteration tasks, it is very likely there is an exist solution.

*** create permutations from a iterable collection of items, by itertools.permutations(iterable[, len])
    The return value is an iterator
    #+begin_src python :results output
    from itertools import permutations
    a = ['a', 'b', 'c']
    for b in permutations(a, 2):
        print(b)
    #+end_src

    #+RESULTS:
    : ('a', 'b')
    : ('a', 'c')
    : ('b', 'a')
    : ('b', 'c')
    : ('c', 'a')
    : ('c', 'b')

*** create combinations from a iterable collection of items, by itertools.combinations(iterable, len)
    The order of items does not matter
    #+begin_src python :results output
    from itertools import combinations
    a = ['a', 'b', 'c']
    for b in combinations(a, 2):
        print(b)
    #+end_src

    #+RESULTS:
    : ('a', 'b')
    : ('a', 'c')
    : ('b', 'c')

*** create combinations from a iterable collection of items, by itertools.combinations_with_replacement(iterable, len), same item can exist more than one times.
    The order of items does not matter
    #+begin_src python :results output
    from itertools import combinations_with_replacement
    a = ['a', 'b', 'c']
    for b in combinations_with_replacement(a, 4):
        print(b)
    #+end_src

    #+RESULTS:
    #+begin_example
    ('a', 'a', 'a', 'a')
    ('a', 'a', 'a', 'b')
    ('a', 'a', 'a', 'c')
    ('a', 'a', 'b', 'b')
    ('a', 'a', 'b', 'c')
    ('a', 'a', 'c', 'c')
    ('a', 'b', 'b', 'b')
    ('a', 'b', 'b', 'c')
    ('a', 'b', 'c', 'c')
    ('a', 'c', 'c', 'c')
    ('b', 'b', 'b', 'b')
    ('b', 'b', 'b', 'c')
    ('b', 'b', 'c', 'c')
    ('b', 'c', 'c', 'c')
    ('c', 'c', 'c', 'c')
#+end_example

** 4.10. Iterating Over the Index-Value Pairs of a Sequence, by enumerate(iterable[, start_index])
   #+begin_src python :results output
   a = ['a', 'b', 'c']
   for i, v in enumerate(a, 1):
       print(i, v)
   #+end_src

   #+RESULTS:
   : 1 a
   : 2 b
   : 3 c

** 4.11. Iterating Over Multiple Sequences Simultaneously, by zip(iterable1, iterable2, ...), shortest
   The zip function will create an iterator that return tuples: first element from iterable1, second element from iterable2, ...
   Should the size of all iterables be the same? => No, it can be different. the returned size is the same as the shortest size of all iterables.
   #+begin_src python :results output
   a =  [1,  2, 3]
   b = ['a', 'b', 'c', 'd']
   for v in zip(a, b):
       print(v)
   #+end_src

   #+RESULTS:
   : (1, 'a')
   : (2, 'b')
   : (3, 'c')

   

** Iterating Over Multiple Sequences Simultaneously, by itertools.zip_longest(iterable1, iterable2, ...), longest
   If you want the returned iterator take the longest size, then use zip_longest. The element value will be None if that  iterable is exzasted.

   From the two functions: zip and zip_longest, there is a lesson: it better to create different function name, than add a more  parameter.
   #+begin_src python :results output
   from itertools import zip_longest
   a =  [1,  2, 3]
   b = ['a', 'b', 'c', 'd']
   for v in zip_longest(a, b):
       print(v)
   #+end_src

   #+RESULTS:
   : (1, 'a')
   : (2, 'b')
   : (3, 'c')
   : (None, 'd')

** 4.12. Iterating on Items in Separate Containers, by itertools.chain(iterable1, iterable2, ...), concat iterables
   #+begin_src python :results output
   from itertools import chain
   a =  [1,  2, 3]
   b = ['a', 'b', 'c', 'd']
   for v in chain(a, b):
       print(v)
   #+end_src

   #+RESULTS:
   : 1
   : 2
   : 3
   : a
   : b
   : c
   : d

   
   
** 4.13. Creating Data Processing Pipelines
   This section is about divide  a task to many small pipelines(steps), by use of generator
   Generator is a  producer, for loop is a comsumer.


*** example: iterate all matched lines from all files in a directory, recursively

    相当于把多重QIAN TAO循环给扁平化了。但执行的顺序完全相同。generator确实比较好用。
    #+begin_src python :results output
    import os
    def gen_filenames(top):
        for dirpath, dirs, files in os.walk(top):
            for f in files:
                yield os.path.join(dirpath, f)

    def gen_open(filenames):
        for f in filenames:
            # print('file names: %s' % f)
            fh = open(f, encoding='utf-8')
            yield fh
            fh.close()

    def gen_lines(files):
        for f in files:
            yield from f

    def gen_match(lines, pattern):
        for v in  lines:
            if pattern in v:
                yield v

    filenames = gen_filenames('..')
    files = gen_open(filenames)
    lines = gen_lines(files)
    matched_lines = gen_match(lines, 'slice')

    for v in matched_lines:
        print(v, end='')
    #+end_src

    #+RESULTS:
    #+begin_example
    *** the slice object
        create a  slice
       s = slice(1,2)
        '1:2' is just a shortcut to 'slice(1,2)'
        slice attributes
        s = slice(1,2,2)
    *** by use of the itertools.islice(start, end, step) functon
        Because we don't know the size of a iterator or a generator, so we can't slice it directly.
        from  itertools import islice as slice_iter
        for b  in slice_iter(iter(a), 2, 5, 1):
            for line in slice_iter(f, 2, 5, 2):
        def slice_iter(aiter, start, end, step):
        for b  in slice_iter(iter(a), 2, 5, 1):
            for line in slice_iter(f, 2, 5, 2):
       if the position is known, then we can use itertools.islice(iterable, start, None) to drop the first 'start' items.
        matched_lines = gen_match(lines, 'slice')
#+end_example

*** [not work]change two embeded for loop to two seperate one by generator
    #+begin_src python :results output
    a = [1, 2, 3]
    b = ['a', 'b']

    for i in a:
        for j in b:
            print(i, j)

    def gen_a(aiter):
        for v in aiter:
            yield v

    def gen_b(aiter, biter):
        for v in aiter:
    #+end_src

    #+RESULTS:

