blog/2017/07/10/python-cookbook-readnote/index.html
<div class="outline-text-3" id="text-orgdb9b193">
</div><div id="outline-container-org30c7f50" class="outline-4">
<h4 id="org30c7f50">by use of the itertools.islice(start, end, step) functon</h4>
<div class="outline-text-4" id="text-org30c7f50">
<p>
Because we don't know the size of a iterator or a generator, so we can't slice it directly.
</p>
<div class="org-src-container">
<pre class="src src-python">from  itertools import islice as slice_iter
a = range(8)
for b  in slice_iter(iter(a), 2, 5, 1):
    print(b)

with open('1.txt') as f:
    for line in slice_iter(f, 2, 5, 2):
        print(line.strip())
</pre>
</div>

<p>
The result is the  same as my impllemented one.
</p>
</div>
</div>

<div id="outline-container-orge31b240" class="outline-4">
<h4 id="orge31b240">a try by me,  works</h4>
<div class="outline-text-4" id="text-orge31b240">
<div class="org-src-container">
<pre class="src src-python">def slice_iter(aiter, start, end, step):
    n = 0
    idx = range(end)[start:end:step]
    for i in range(end):
        v = next(aiter)
        if i in idx:
            yield v

a = range(8)
for b  in slice_iter(iter(a), 2, 5, 1):
    print(b)

with open('1.txt') as f:
    for line in slice_iter(f, 2, 5, 2):
        print(line.strip())
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org7f97dac" class="outline-3">
<h3 id="org7f97dac">4.8. Skipping the First Part of an Iterable, by itertools.dropwhile(test_func, iterable)</h3>
<div class="outline-text-3" id="text-org7f97dac">
<div class="org-src-container">
<pre class="src src-python">import itertools
with open('1.txt') as f:
    for line in itertools.dropwhile(lambda x: x.startswith('#'), f):
        print(line, end='')
</pre>
</div>

<p>
This is different from filtering
</p>

<p>
if the position is known, then we can use itertools.islice(iterable, start, None) to drop the first 'start' items.
</p>
</div>
</div>


<div id="outline-container-org08314c9" class="outline-3">
<h3 id="org08314c9">4.9. Iterating Over All Possible Combinations or Permutations</h3>
<div class="outline-text-3" id="text-org08314c9">
<p>
An important aspect  of itertools module: for complex iteration tasks, it is very likely there is an exist solution.
</p>
</div>

<div id="outline-container-org6937c7a" class="outline-4">
<h4 id="org6937c7a">create permutations from a iterable collection of items, by itertools.permutations(iterable[, len])</h4>
<div class="outline-text-4" id="text-org6937c7a">
<p>
The return value is an iterator
</p>
<div class="org-src-container">
<pre class="src src-python">from itertools import permutations
a = ['a', 'b', 'c']
for b in permutations(a, 2):
    print(b)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc3cdf77" class="outline-4">
<h4 id="orgc3cdf77">create combinations from a iterable collection of items, by itertools.combinations(iterable, len)</h4>
<div class="outline-text-4" id="text-orgc3cdf77">
<p>
The order of items does not matter
</p>
<div class="org-src-container">
<pre class="src src-python">from itertools import combinations
a = ['a', 'b', 'c']
for b in combinations(a, 2):
    print(b)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc4ee9a7" class="outline-4">
<h4 id="orgc4ee9a7">create combinations from a iterable collection of items, by itertools.combinations_with_replacement(iterable, len), same item can exist more than one times.</h4>
<div class="outline-text-4" id="text-orgc4ee9a7">
<p>
The order of items does not matter
</p>
<div class="org-src-container">
<pre class="src src-python">from itertools import combinations_with_replacement
a = ['a', 'b', 'c']
for b in combinations_with_replacement(a, 4):
    print(b)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org887eac3" class="outline-3">
<h3 id="org887eac3">4.10. Iterating Over the Index-Value Pairs of a Sequence, by enumerate(iterable[, start_index])</h3>
<div class="outline-text-3" id="text-org887eac3">
<div class="org-src-container">
<pre class="src src-python">a = ['a', 'b', 'c']
for i, v in enumerate(a, 1):
    print(i, v)
</pre>
</div>
</div>
</div>

<div id="outline-container-org2c8935b" class="outline-3">
<h3 id="org2c8935b">4.11. Iterating Over Multiple Sequences Simultaneously, by zip(iterable1, iterable2, ...), shortest</h3>
<div class="outline-text-3" id="text-org2c8935b">
<p>
The zip function will create an iterator that return tuples: first element from iterable1, second element from iterable2, ...
Should the size of all iterables be the same? =&gt; No, it can be different. the returned size is the same as the shortest size of all iterables.
</p>
<div class="org-src-container">
<pre class="src src-python">a =  [1,  2, 3]
b = ['a', 'b', 'c', 'd']
for v in zip(a, b):
    print(v)
</pre>
</div>
</div>
</div>



<div id="outline-container-orgafe668e" class="outline-3">
<h3 id="orgafe668e">Iterating Over Multiple Sequences Simultaneously, by itertools.zip_longest(iterable1, iterable2, ...), longest</h3>
<div class="outline-text-3" id="text-orgafe668e">
<p>
If you want the returned iterator take the longest size, then use zip_longest. The element value will be None if that  iterable is exzasted.
</p>

<p>
From the two functions: zip and zip_longest, there is a lesson: it better to create different function name, than add a more  parameter.
</p>
<div class="org-src-container">
<pre class="src src-python">from itertools import zip_longest
a =  [1,  2, 3]
b = ['a', 'b', 'c', 'd']
for v in zip_longest(a, b):
    print(v)
</pre>
</div>
</div>
</div>

<div id="outline-container-org4310b1c" class="outline-3">
<h3 id="org4310b1c">4.12. Iterating on Items in Separate Containers, by itertools.chain(iterable1, iterable2, ...), concat iterables</h3>
<div class="outline-text-3" id="text-org4310b1c">
<div class="org-src-container">
<pre class="src src-python">from itertools import chain
a =  [1,  2, 3]
b = ['a', 'b', 'c', 'd']
for v in chain(a, b):
    print(v)
</pre>
</div>
</div>
</div>



<div id="outline-container-org0da8a12" class="outline-3">
<h3 id="org0da8a12">4.13. Creating Data Processing Pipelines</h3>
<div class="outline-text-3" id="text-org0da8a12">
<p>
This section is about divide  a task to many small pipelines(steps), by use of generator
Generator is a  producer, for loop is a comsumer.
</p>
</div>


<div id="outline-container-org478a561" class="outline-4">
<h4 id="org478a561">example: iterate all matched lines from all files in a directory, recursively</h4>
<div class="outline-text-4" id="text-org478a561">
<p>
相当于把多重QIAN TAO循环给扁平化了。但执行的顺序完全相同。generator确实比较好用。
</p>
<div class="org-src-container">
<pre class="src src-python">import os
def gen_filenames(top):
    for dirpath, dirs, files in os.walk(top):
        for f in files:
            yield os.path.join(dirpath, f)

def gen_open(filenames):
    for f in filenames:
        # print('file names: %s' % f)
        fh = open(f, encoding='utf-8')
        yield fh
        fh.close()

def gen_lines(files):
    for f in files:
        yield from f

def gen_match(lines, pattern):
    for v in  lines:
        if pattern in v:
            yield v

filenames = gen_filenames('..')
files = gen_open(filenames)
lines = gen_lines(files)
matched_lines = gen_match(lines, 'slice')

for v in matched_lines:
    print(v, end='')
</pre>
</div>
</div>
</div>

<div id="outline-container-org1028931" class="outline-4">
<h4 id="org1028931">[not work]change two embeded for loop to two seperate one by generator</h4>
<div class="outline-text-4" id="text-org1028931">
<div class="org-src-container">
<pre class="src src-python">a = [1, 2, 3]
b = ['a', 'b']

for i in a:
    for j in b:
        print(i, j)

def gen_a(aiter):
    for v in aiter:
        yield v

def gen_b(aiter, biter):
    for v in aiter:
</pre>
</div>
</div>
</div>
</div>
