blog/python-cookbook-readnote.org
** 4.14. Flattening a Nested Sequence, by generator, recursively
   Why this function is not included in itertools module?
   #+begin_src python :results output
   from collections import Iterable
   def  flatten(items, ignored_types=(str, bytes)):
       for v in items:
           if isinstance(v, Iterable) and not isinstance(v, ignored_types):
               yield from flatten(v, ignored_types)
           else:
               yield v

   a = [1, 2, [3, 4, [5, 6], 7],  8, 'abc']
   for v in a:
       print(v)

   print("the flattened version")
   for v in flatten(a):
       print(v)
   #+end_src

   #+RESULTS:
   #+begin_example
   1
   2
   [3, 4, [5, 6], 7]
   8
   abc
   the flattened version
   1
   2
   3
   4
   5
   6
   7
   8
   abc
#+end_example

   
** yield from just like a for loop
   #+begin_src python :results output
   def gen_a():
       for v in range(3):
           yield v

   def gen_b(gena):
       yield from gena

   def for_b(gena):
       for v  in gena:
           yield v

   # the gen_b and for_b works exactly the same, but the yield from is better
   for v in gen_b(gen_a()):
       print(v)

   print('the for version')
   for v in for_b(gen_a()):
       print(v)
   #+end_src

   #+RESULTS:
   : 0
   : 1
   : 2
   : the for version
   : 0
   : 1
   : 2

** 4.15. Iterating in Sorted Order Over Merged Sorted Iterables, by heapq.merge(iterable1, iterable2, ...)
   the input iterables should in sorted order. then it will create an new iterable of sorted items from all input.
   #+begin_src python :results output
   a = [1, 4, 8]
   b = [2, 3,  7, 9]

   import heapq
   for v in heapq.merge(a, b):
       print(v)
   #+end_src

   The function will only get the needed items into memory. So it better to merge two sorted files.

   Similar  to ~sorted(itertools.chain(*iterables))~, but will not read all content to memory.
** 4.16. Replacing Infinite conditional while Loops with an Iterator, by iter(callable, sentinel) function
   invoke the callable UNTIL it returns the sentinel

   Means: repeated invoke the callable, and return its return value, until the return value equal to the sentinel.
   #+begin_src python :results output
   a = [1, 2, 3, 4, 5]
   idx = -1
   def foo():
       global idx
       idx+=1
       return a[idx]

   for v in iter(foo, 3):
       print(v)
   #+end_src

   #+RESULTS:
   : 1
   : 2

* chapter 8: Classes and Objects
** 8.1. Changing the String Representation of Instances
   It's good practice to define both __repr__() and __str__()

*** the __repr__() method of a class: the literal representation of a object
    eval(repr(x)) = x
    It it not possiable to create an object from the repr(x) results, then the repr(x) result should be enclosed in '<>' 

*** the __str__() method of a class: the toString method  of a object
    The method will be called  when the object is passed to print() function
    If __str__() is not provided, then __repr__() will be used.

*** the format function: positional field, by {N}, N means the nth parameter
    ValueError: cannot switch from manual field specification to automatic field numbering
    If you put a numbers to a field, then you should put numbers to all field.
    #+begin_src python :results output
    a = '{0}, {1},  {1}'.format(1, 2)
    print(a)
    #+end_src

    #+RESULTS:
    : 1, 2,  2

    Get an object's attribute by {N.attt_name} syntax
    #+begin_src python :results output
    import itertools
    a = '{0}, {0.chain}, {0.permutations}'.format(itertools)
    print(a)
    #+end_src

    #+RESULTS:
    : <module 'itertools' (built-in)>, <class 'itertools.chain'>, <class 'itertools.permutations'>

    for {0!r} or {0!s}, '!r' means use __repr__(), '!s' means use __str__(). '!s' is the default value.
    
** 8.2. Customizing String Formatting 

*** the format(aobj[, format_spec]) builtin function 
    The function is equal to: aobj.__format__(format_spec)
    而一般的aobj.__format__(spec) 的实现是调用 str.format(...) 函数来实现。

    str.format(...) method 还支持关键字参数来指定field name.(问题：当关键字参数与普通参数混合时会发生什么？)
    {:spec} 中的 spec 会传给 aobj.__format__(format_spec) 作为参数。 spec 可以为任意字符串，它可以作为参数传递给aobj.__format__() method.

    str.format(aobj)时， 到底是哪个method会被调用呢？
    From below codes, it can be see that if __format__ method is defined, then __format__ will be called. else __str__ will be called, when the object is formated by the str.format(...) method.
    For str(aobj), aobj.__str__ will always be called.
    #+begin_src python :results output
    class Point:
        def __init__(self, x, y):
            self.x = x
            self.y = y

        def __repr__(self):
            print("__repr__ called")
            return 'Point({0.x}, {0.y})'.format(self)

        def __str__(self):
            print("__str__ called")
            return '({0.x}, {0.y})'.format(self)

        def __format__(self, spec):
            print("__format__ called. spec: %s." % spec)
            return '({0.x}, {0.y})'.format(self)

    p = Point(2, 3)
    a = '{}'.format(p)
    print(a)
    print(p)


    #+end_src

    #+RESULTS:
    : __format__ called. spec: .
    : (2, 3)
    : __str__ called
    : (2, 3)

** [NOT FINISHED]8.3. Making Objects Support the Context-Management Protocol, that is, the with statement
   To provide with statement support, just define two methods:
   1. __enter__(self)
   2. __exit__(self, exc_ty, exc_val, tb)
   
   #+begin_src python :results output
   class SaveVar:
       def __init__(self, avar):
           self.avar = avar
       def __enter__(self):
           print("__enter__ called")
   #+end_src

** 8.5. Encapsulating Names in a Class
*** one underscore _ means private variable, just convention, you can still access that  variable outside  of a class
    #+begin_src python :results output
    class Person:
        def __init__(self, name, age):
            self._name = name
            self._age = age
        def __str__(self):
            return '(name: {}, age: {})'.format(self._name, self._age)

    p = Person('Jim', 23)
    print(p)
    print(p._name, p._age)
    #+end_src

    #+RESULTS:
    : (name: Jim, age: 23)
    : Jim 23

*** two underscore __ means name mangling, when used for inheritance
    the variable will be renamed to _C__name. Then it will not override the super class's variable.
    Because it is also has one leading underscore, so the rules for one underscore also applies.

    __age is renamed to _Person__age:
    #+begin_src python :results output
    class Person:
        def __init__(self, name, age):
            self._name = name
            self.__age = age
        def __str__(self):
            return '(name: {}, age: {})'.format(self._name, self.__age)

    p = Person('Jim', 23)
    print(p)
    print(dir(p))
    print(p._name, p._Person__age)
    #+end_src

    #+RESULTS:
    : (name: Jim, age: 23)
    : ['_Person__age', '__class__', '__delattr__', '__dict__', '__dir__', '__doc__', '__eq__', '__format__', '__ge__', '__getattribute__', '__gt__', '__hash__', '__init__', '__init_subclass__', '__le__', '__lt__', '__module__', '__ne__', '__new__', '__reduce__', '__reduce_ex__', '__repr__', '__setattr__', '__sizeof__', '__str__', '__subclasshook__', '__weakref__', '_name']
    : Jim 23

