blog/2017/07/10/python-cookbook-readnote/index.html

<div id="outline-container-orgc07549f" class="outline-3">
<h3 id="orgc07549f">4.14. Flattening a Nested Sequence, by generator, recursively</h3>
<div class="outline-text-3" id="text-orgc07549f">
<p>
Why this function is not included in itertools module?
</p>
<div class="org-src-container">
<pre class="src src-python">from collections import Iterable
def  flatten(items, ignored_types=(str, bytes)):
    for v in items:
        if isinstance(v, Iterable) and not isinstance(v, ignored_types):
            yield from flatten(v, ignored_types)
        else:
            yield v

a = [1, 2, [3, 4, [5, 6], 7],  8, 'abc']
for v in a:
    print(v)

print("the flattened version")
for v in flatten(a):
    print(v)
</pre>
</div>
</div>
</div>


<div id="outline-container-orgcf7804f" class="outline-3">
<h3 id="orgcf7804f">yield from just like a for loop</h3>
<div class="outline-text-3" id="text-orgcf7804f">
<div class="org-src-container">
<pre class="src src-python">def gen_a():
    for v in range(3):
        yield v

def gen_b(gena):
    yield from gena

def for_b(gena):
    for v  in gena:
        yield v

# the gen_b and for_b works exactly the same, but the yield from is better
for v in gen_b(gen_a()):
    print(v)

print('the for version')
for v in for_b(gen_a()):
    print(v)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc70f8d7" class="outline-3">
<h3 id="orgc70f8d7">4.15. Iterating in Sorted Order Over Merged Sorted Iterables, by heapq.merge(iterable1, iterable2, ...)</h3>
<div class="outline-text-3" id="text-orgc70f8d7">
<p>
the input iterables should in sorted order. then it will create an new iterable of sorted items from all input.
</p>
<div class="org-src-container">
<pre class="src src-python">a = [1, 4, 8]
b = [2, 3,  7, 9]

import heapq
for v in heapq.merge(a, b):
    print(v)
</pre>
</div>

<p>
The function will only get the needed items into memory. So it better to merge two sorted files.
</p>

<p>
Similar  to <code>sorted(itertools.chain(*iterables))</code>, but will not read all content to memory.
</p>
</div>
</div>
<div id="outline-container-orgf739acd" class="outline-3">
<h3 id="orgf739acd">4.16. Replacing Infinite conditional while Loops with an Iterator, by iter(callable, sentinel) function</h3>
<div class="outline-text-3" id="text-orgf739acd">
<p>
invoke the callable UNTIL it returns the sentinel
</p>

<p>
Means: repeated invoke the callable, and return its return value, until the return value equal to the sentinel.
</p>
<div class="org-src-container">
<pre class="src src-python">a = [1, 2, 3, 4, 5]
idx = -1
def foo():
    global idx
    idx+=1
    return a[idx]

for v in iter(foo, 3):
    print(v)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org893fb6f" class="outline-2">
<h2 id="org893fb6f">chapter 8: Classes and Objects</h2>
<div class="outline-text-2" id="text-org893fb6f">
</div><div id="outline-container-org20b32b0" class="outline-3">
<h3 id="org20b32b0">8.1. Changing the String Representation of Instances</h3>
<div class="outline-text-3" id="text-org20b32b0">
<p>
It's good practice to define both __repr__() and __str__()
</p>
</div>

<div id="outline-container-orgf985aa8" class="outline-4">
<h4 id="orgf985aa8">the __repr__() method of a class: the literal representation of a object</h4>
<div class="outline-text-4" id="text-orgf985aa8">
<p>
eval(repr(x)) = x
It it not possiable to create an object from the repr(x) results, then the repr(x) result should be enclosed in '&lt;&gt;' 
</p>
</div>
</div>

<div id="outline-container-org870ef6d" class="outline-4">
<h4 id="org870ef6d">the __str__() method of a class: the toString method  of a object</h4>
<div class="outline-text-4" id="text-org870ef6d">
<p>
The method will be called  when the object is passed to print() function
If __str__() is not provided, then __repr__() will be used.
</p>
</div>
</div>

<div id="outline-container-org2ac9bf7" class="outline-4">
<h4 id="org2ac9bf7">the format function: positional field, by {N}, N means the nth parameter</h4>
<div class="outline-text-4" id="text-org2ac9bf7">
<p>
ValueError: cannot switch from manual field specification to automatic field numbering
If you put a numbers to a field, then you should put numbers to all field.
</p>
<div class="org-src-container">
<pre class="src src-python">a = '{0}, {1},  {1}'.format(1, 2)
print(a)
</pre>
</div>

<p>
Get an object's attribute by {N.attt_name} syntax
</p>
<div class="org-src-container">
<pre class="src src-python">import itertools
a = '{0}, {0.chain}, {0.permutations}'.format(itertools)
print(a)
</pre>
</div>

<p>
for {0!r} or {0!s}, '!r' means use __repr__(), '!s' means use __str__(). '!s' is the default value.
</p>
</div>
</div>
</div>

<div id="outline-container-org3157c91" class="outline-3">
<h3 id="org3157c91">8.2. Customizing String Formatting</h3>
<div class="outline-text-3" id="text-org3157c91">
</div><div id="outline-container-orge035683" class="outline-4">
<h4 id="orge035683">the format(aobj[, format_spec]) builtin function</h4>
<div class="outline-text-4" id="text-orge035683">
<p>
The function is equal to: aobj.__format__(format_spec)
而一般的aobj.__format__(spec) 的实现是调用 str.format(...) 函数来实现。
</p>

<p>
str.format(...) method 还支持关键字参数来指定field name.(问题：当关键字参数与普通参数混合时会发生什么？)
{:spec} 中的 spec 会传给 aobj.__format__(format_spec) 作为参数。 spec 可以为任意字符串，它可以作为参数传递给aobj.__format__() method.
</p>

<p>
str.format(aobj)时， 到底是哪个method会被调用呢？
From below codes, it can be see that if <span class="underline"><span class="underline">format</span></span> method is defined, then <span class="underline"><span class="underline">format</span></span> will be called. else <span class="underline"><span class="underline">str</span></span> will be called, when the object is formated by the str.format(...) method.
For str(aobj), aobj.__str__ will always be called.
</p>
<div class="org-src-container">
<pre class="src src-python">class Point:
    def __init__(self, x, y):
        self.x = x
        self.y = y

    def __repr__(self):
        print("__repr__ called")
        return 'Point({0.x}, {0.y})'.format(self)

    def __str__(self):
        print("__str__ called")
        return '({0.x}, {0.y})'.format(self)

    def __format__(self, spec):
        print("__format__ called. spec: %s." % spec)
        return '({0.x}, {0.y})'.format(self)

p = Point(2, 3)
a = '{}'.format(p)
print(a)
print(p)


</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orga1363f4" class="outline-3">
<h3 id="orga1363f4">[NOT FINISHED]8.3. Making Objects Support the Context-Management Protocol, that is, the with statement</h3>
<div class="outline-text-3" id="text-orga1363f4">
<p>
To provide with statement support, just define two methods:
</p>
<ol class="org-ol">
<li>__enter__(self)</li>
<li>__exit__(self, exc_ty, exc_val, tb)</li>
</ol>

<div class="org-src-container">
<pre class="src src-python">class SaveVar:
    def __init__(self, avar):
        self.avar = avar
    def __enter__(self):
        print("__enter__ called")
</pre>
</div>
</div>
</div>

<div id="outline-container-org81f18d8" class="outline-3">
<h3 id="org81f18d8">8.5. Encapsulating Names in a Class</h3>
<div class="outline-text-3" id="text-org81f18d8">
</div><div id="outline-container-orgcae4b5b" class="outline-4">
<h4 id="orgcae4b5b">one underscore _ means private variable, just convention, you can still access that  variable outside  of a class</h4>
<div class="outline-text-4" id="text-orgcae4b5b">
<div class="org-src-container">
<pre class="src src-python">class Person:
    def __init__(self, name, age):
        self._name = name
        self._age = age
    def __str__(self):
        return '(name: {}, age: {})'.format(self._name, self._age)

p = Person('Jim', 23)
print(p)
print(p._name, p._age)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf4dfffa" class="outline-4">
<h4 id="orgf4dfffa">two underscore __ means name mangling, when used for inheritance</h4>
<div class="outline-text-4" id="text-orgf4dfffa">
<p>
the variable will be renamed to _C__name. Then it will not override the super class's variable.
Because it is also has one leading underscore, so the rules for one underscore also applies.
</p>

<p>
__age is renamed to _Person__age:
</p>
<div class="org-src-container">
<pre class="src src-python">class Person:
    def __init__(self, name, age):
        self._name = name
        self.__age = age
    def __str__(self):
        return '(name: {}, age: {})'.format(self._name, self.__age)

p = Person('Jim', 23)
print(p)
print(dir(p))
print(p._name, p._Person__age)
</pre>
</div>
</div>
</div>
</div>
