blog/python-cookbook-readnote.org
** 8.6. Creating Managed Attributes, with @property decorator/annotation, add a setter, getter, deleter to a field
   Steps:
   1. first create a property object by @property decorator, on a getter method. The name of the getter should be the same with the attribute field.
   2. create the setter object: by @attribute_name.setter, on a setter method. The name of the setter should be the same with the attribute field.
   3. the getter, setter function are a way to define what will be called when the attribute with the same name is get,  set. 
      e.g. the attribute name is 'foo', then the 'foo' attribute will be a object that has methods: 'getter', 'setter', 'deleter'. You can choose any name to store the real value for this  attribute, but the most common value will be add a underscore, that is '_foo'.
      Type of 'foo' is <class 'property'>
   
    #+begin_src python :results output
    class Person:
        def __init__(self, name, age):
            # here the name attribute is depend on the def name(self) getter function. Not the reverse.
            self.name = name
            self.age = age
        def __str__(self):
            return '(name: {}, age: {})'.format(self.name, self.age)

        @property
        def name(self):
            print("getting name")
            return self.nameL

        @name.setter
        def name(self, name):
            print("setting name")
            if not isinstance(name, str):
                raise TypeError

            self.nameL = name

    p = Person('Jim', 23)
    p.name = "Tom"
    print(p)
    print(dir(p))
    print(type(Person.name), dir(Person.name))
    #+end_src

    #+RESULTS:
    : setting name
    : setting name
    : getting name
    : (name: Tom, age: 23)
    : ['__class__', '__delattr__', '__dict__', '__dir__', '__doc__', '__eq__', '__format__', '__ge__', '__getattribute__', '__gt__', '__hash__', '__init__', '__init_subclass__', '__le__', '__lt__', '__module__', '__ne__', '__new__', '__reduce__', '__reduce_ex__', '__repr__', '__setattr__', '__sizeof__', '__str__', '__subclasshook__', '__weakref__', 'age', 'name', 'nameL']
    : <class 'property'> ['__class__', '__delattr__', '__delete__', '__dir__', '__doc__', '__eq__', '__format__', '__ge__', '__get__', '__getattribute__', '__gt__', '__hash__', '__init__', '__init_subclass__', '__isabstractmethod__', '__le__', '__lt__', '__ne__', '__new__', '__reduce__', '__reduce_ex__', '__repr__', '__set__', '__setattr__', '__sizeof__', '__str__', '__subclasshook__', 'deleter', 'fdel', 'fget', 'fset', 'getter', 'setter']

** create caculate attribute by @property, getter, setter, then the attribute works like a attribute,  not a method
   Seems a good application of @property.

    #+begin_src python :results output
    class Circle:
        def __init__(self, radis):
            self.radis = radis

        @property
        def area(self):
            print("getting area")
            return self.radis*self.radis*3.14

    p = Circle(4)
    print(p.radis)
    print(p.area)
    #+end_src

    #+RESULTS:
    : 4
    : getting area
    : 50.24

** 8.7. Calling a Method on a Parent Class, by super() function
   There are many format
   #+begin_src python :results output
   super() # unbound
   super(type, obj) # isinstance(obj, type)
   super(type, type2) # issubclass(type2, type). issubclass(object, object) is True
   #+end_src
** 8.9. Creating a New Kind of Class or Instance Attribute, by creating a descriptor class for the type
   如果一个类定义了三个函数： __get__, __set__, __delete__, 则它是一个descriptor, 可能通过它来为一个instance的attribute添加一些get, set时的函数。

   @property 只是descriptor的一种表象， descriptor是最底层，最灵活的实现，在库中大量使用。 TODO： 可以再研究下基于descriptor， @property的实现。

   调用顺序：如果descriptor对应的class attribute 存在, 则总会优先调用这个descriptor的函数，来获取或设置attribute的值。
   但当descriptor只定义了__get__方法时，则如果同名的变量在instance.__dict__中存在，则会优先从instance.__dict__中获取。
   
   #+begin_src python :results output
   class Integer:
       def __init__(self, name):
           self.name = name

       def __get__(self, instance, cls):
           print("__get__ method called, name: %s" % self.name)
           # If instance is None, then it is the class attribute
           if instance:
               return instance.__dict__[self.name]
           else:
               return instance

       def __set__(self, instance, value):
           print("__set__ method called, name %s, value: %s" % (self.name, value))
           instance.__dict__[self.name] = value

   class Point:
       # 关键的是量的值，输入参数的值只是用于内部实现的。并且Integer的实现中使用instance.__dict__保存数据也只是一种实现方式。
       # Point.x决定了atribute的名称为x
       x = Integer('z')
       def __init__(self, x, y):
           self.x = x
           self.y = y

       def __str__(self):
           return '({0.x}, {0.y})'.format(self)


   p = Point(3, 2)
   print("p.x")
   print(p.x)
   print(p.__dict__)
   # setattr(p, 'x', 5)
   p.__dict__['x'] = 5
   print(p.x)
   print(p.__dict__)
   #+end_src

   #+RESULTS:
   : __set__ method called, name z, value: 3
   : p.x
   : __get__ method called, name: z
   : 3
   : {'z': 3, 'y': 2}
   : __get__ method called, name: z
   : 3
   : {'z': 3, 'y': 2, 'x': 5}

** 8.10. Using Lazily Computed Properties, an application of descriptor
** 8.11. Simplifying the Initialization of Data Structures, by define a common base class
   #+begin_src python :results output
   # python  is very flexiable
   class Structure:
       _fields = []
       def __init__(self, *args):
           if len(self._fields) != len(args):
               raise TypeError('Expected {} arguments'.format(len(self._fields)))
           for k, v in zip(self._fields, args):
               setattr(self, k, v)
       def __str__(self):
           return '({})'.format(', '.join('{}: {}'.format(f, getattr(self, f)) for f in self._fields))

   class Point(Structure):
       _fields = ['x', 'y']
       # def __str__(self):
       #     return '(x: {0.x}, y: {0.y})'.format(self)

   class Circle(Structure):
       _fields = ['radius']
       # def __str__(self):
       #     return '(radius: {0.radius})'.format(self)

   p = Point(1, 2)
   print(p)
   p = Circle(3)
   print(p)
   #+end_src

   #+RESULTS:
   : (x: 1, y: 2)
   : (radius: 3)

** class attributes can also be accessed by instance object, such as self, but only when the same instance attribute not exists
   #+begin_src python :results output
   class Foo:
       class_attr = "ABC"
       def __init__(self, a):
           self.a = a

   f = Foo('BB')
   print(f.class_attr, f.a)
   print(f.class_attr is Foo.class_attr)

   class Bar:
       class_attr = "ABC"
       def __init__(self, a):
           self.class_attr = a
           self.a = a

   b = Bar('BB')
   print(b.class_attr, b.a)
   print(b.class_attr is Bar.class_attr)
   #+end_src

   #+RESULTS:
   : ABC BB
   : True
   : BB BB
   : False

** 8.12. Defining an Interface or Abstract Base Class
*** create an abstract base class, or interface, by abc.ABCMeta, abc.abstractmethod
    A abstract class can't be initialized.
    #+begin_src python :results output
    from abc import ABCMeta, abstractmethod
    class IStream(metaclass=ABCMeta):
        @abstractmethod
        def read(self, maxbytes=-1):
            pass
        @abstractmethod
        def write(self, data):
            pass

    # typical usage:
    def  foo(obj):
        if isinstance(obj, IStream):
            # processing an IStream here
            pass

    a = IStream()
    #+end_src

    #+RESULTS:

