blog/python-cookbook-readnote.org
*** register another class to a 'sub class ' of a abstract base class, by abc.register(cls) function
    Then isinstance(obj, AbstractBaseClass) will be  True. This let another class which is not a subclass of a base class, but can still pass the isinstance() test, which means implementing a interface.

    #+begin_src python :results output
    import io
    # Register the built-in I/O classes as supporting our interface
    IStream.register(io.IOBase)
    # Open a normal file and type check
    f = open('foo.txt')
    isinstance(f, IStream) # Returns True
    #+end_src

    #+RESULTS:

** 8.13. Implementing a Data Model or Type System, by descriptor
   感觉根之前小节讲到的descriptor相同，只不过用了继承的方式写了很多细小的descriptor。
** what is a descriptor? and its usage
   A descriptor is  a class attribute object, which has __get__, __set__, or __delete__ method, is used to define how a instance attribute is get, set, and delete. When an  instance attribute is get, the descriptor's __get__ method will be called. The same thing applys to __set__ and __delete__

   In descriptor's __get__, __set__ methods, we must use instance.__dict__[xxx] to get a attribute. If we use getattr(instance, xxx) to get that attribute, then there will be a recursion error as below, because the getattr() function will trigger a new call of __get__ method.
   RecursionError: maximum recursion depth exceeded while calling a Python object

   The relationship between the descriptor object and an instance attribute:
   1. if the descriptor object is assigned to a class attribute with name 'attribute_a', then it will control the instance attribute with the same name.
   2. but there is  one exception: if only the __get__ method of a descriptor is defined, then the instance attribute with the same name will be not be controled by the  descriptor, it will be get directly from the __dict__.
   
   a test:
   #+begin_src python :results output
   class TraceDescriptor:
       def __init__(self, name):
           self.name = name

       def __get__(self, instance, cls):
           if instance:
               print('Getting attribute {}, value is {}'.format(self.name, instance.__dict__[self.name]))
               return instance.__dict__[self.name]
               # return getattr(instance, self.name)
           else:
               return instance


       def __set__(self, instance, value):
           print('Setting attribute {} to {}'.format(self.name, value))
           instance.__dict__[self.name] = value

   class Circle:
       radius = TraceDescriptor('radius')
       def __init__(self,  radius):
           self.radius = radius

   c =  Circle(4)

   print(c.radius)
   #+end_src

   #+RESULTS:

** 8.16. Defining More Than One Constructor in a Class, use a class method
   GP: Always only assign values in the default  constructor(__init__), and do other things by other constructors
   #+begin_src python :results output
   import time

   class Date:
       def __init__(self, y, m,  d):
           self.year = y
           self.month = m
           self.day =  d

       @classmethod
       def today(cls):
           t = time.localtime()
           return cls(t.tm_year, t.tm_mon, t.tm_mday)

       def __str__(self):
           return '({0.year}, {0.month}, {0.day})'.format(self)

   d1 = Date(2017, 1, 2)
   d2 = Date.today()
   print(d1, d2)

   #+end_src

   #+RESULTS:
   : (2017, 1, 2) (2017, 4, 17)

** 8.17. Creating an Instance Without Invoking init
*** the object.__new__(*args, **kwargs) method: create a bare object
    Every object has a __new__method, which is inheritantanted from type.__new__.

    The parameter should be a type object.

    When you want to create an object from a json, this method can be used.
   
    #+begin_src python :results output
    import aspk_common as AC
    class Foo(AC.Structure):
        _fields = ['x']

    f = Foo(2)
    g = Foo.__new__(Foo)
    print(f)
    print(f.__dict__)
    print(g.__dict__)
    print(dir(f))
    print(dir(g))
    #+end_src

    #+RESULTS:
    : (x: 2)
    : {'x': 2}
    : {}
    : ['__class__', '__delattr__', '__dict__', '__dir__', '__doc__', '__eq__', '__format__', '__ge__', '__getattribute__', '__gt__', '__hash__', '__init__', '__init_subclass__', '__le__', '__lt__', '__module__', '__ne__', '__new__', '__reduce__', '__reduce_ex__', '__repr__', '__setattr__', '__sizeof__', '__str__', '__subclasshook__', '__weakref__', '_fields', 'x']
    : ['__class__', '__delattr__', '__dict__', '__dir__', '__doc__', '__eq__', '__format__', '__ge__', '__getattribute__', '__gt__', '__hash__', '__init__', '__init_subclass__', '__le__', '__lt__', '__module__', '__ne__', '__new__', '__reduce__', '__reduce_ex__', '__repr__', '__setattr__', '__sizeof__', '__str__', '__subclasshook__', '__weakref__', '_fields']
*** Problem: how an object is constructed?
    I guess first create a bare object by  calling the __new__ method, then call the object's __init__ method.

** 8.18. Extending Classes with Mixins
*** mixin classes, used to extend function of a class, class customization, by multiple inheritance
    SOLVED, see another comment. How below codes works? For 'super().__getitem__(key)', why dict.__getitem__ method will be called?

    After figuring out MRO, then I know how a mixin class works:
    Mixin class is used to customize an existing class.
    It make use of  MRO of multiple inheritance. Suppose 'Base' is the class to be customized, 'Mixin' is the mixin class, 'Foo' is the result  class, then the typical syntax is:
    #+begin_src python :results output
    class Foo(Mixin, Base):
        pass
    #+end_src
    That is, put the mixin class as the first parent class, and the Base class as the second class. Then e.g. you want change a method of Base's behavier, such as 'foo', then you can just define a method named 'foo' in Mixin, and doing some work, then call 'super().foo(...)' to call Base's foo method.

    Works like a decorator pattern.

    But  what's difference between this method and by directly define the 'foo' method in Foo?
    => maybe the main benifet is that  by putting the codes to a Mixin class, the codes can be easily reused.

    
    #+begin_src python :results output
    import aspk_common as AC
    class Logging:
        __slots__ = ()
        def __getitem__(self, key):
            print('Getting {}'.format(key))
            print('self: {}\nsuper: {}'.format(self, super()))
            return super().__getitem__(key)

    class LoggingDict(Logging, dict):
        pass

    d = LoggingDict()
    d['x'] = 2
    print(d['x'])

    #+end_src

    #+RESULTS:
    : Getting x
    : self: {'x': 2}
    : super: <super: <class 'Logging'>, <LoggingDict object>>
    : 2

** mutiple inheritance: how method/attribue are resolved if they exists in more than one  super classes
   A method/attribute is resolved in the order of all parent class given.
   e.g: 
   class Foo(A, B)
   if a method 'aaa' is defined in  both A and B, then A.aaa will be used.

