blog/2017/07/10/python-cookbook-readnote/index.html

<div id="outline-container-org14f8fb6" class="outline-4">
<h4 id="org14f8fb6">register another class to a 'sub class ' of a abstract base class, by abc.register(cls) function</h4>
<div class="outline-text-4" id="text-org14f8fb6">
<p>
Then isinstance(obj, AbstractBaseClass) will be  True. This let another class which is not a subclass of a base class, but can still pass the isinstance() test, which means implementing a interface.
</p>

<div class="org-src-container">
<pre class="src src-python">import io
# Register the built-in I/O classes as supporting our interface
IStream.register(io.IOBase)
# Open a normal file and type check
f = open('foo.txt')
isinstance(f, IStream) # Returns True
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgfdcc896" class="outline-3">
<h3 id="orgfdcc896">8.13. Implementing a Data Model or Type System, by descriptor</h3>
<div class="outline-text-3" id="text-orgfdcc896">
<p>
感觉根之前小节讲到的descriptor相同，只不过用了继承的方式写了很多细小的descriptor。
</p>
</div>
</div>
<div id="outline-container-org9d12d96" class="outline-3">
<h3 id="org9d12d96">what is a descriptor? and its usage</h3>
<div class="outline-text-3" id="text-org9d12d96">
<p>
A descriptor is  a class attribute object, which has <span class="underline"><span class="underline">get</span></span>, <span class="underline"><span class="underline">set</span></span>, or <span class="underline"><span class="underline">delete</span></span> method, is used to define how a instance attribute is get, set, and delete. When an  instance attribute is get, the descriptor's <span class="underline"><span class="underline">get</span></span> method will be called. The same thing applys to <span class="underline"><span class="underline">set</span></span> and <span class="underline"><span class="underline">delete</span></span>
</p>

<p>
In descriptor's <span class="underline"><span class="underline">get</span></span>, <span class="underline"><span class="underline">set</span></span> methods, we must use instance.__dict__[xxx] to get a attribute. If we use getattr(instance, xxx) to get that attribute, then there will be a recursion error as below, because the getattr() function will trigger a new call of <span class="underline"><span class="underline">get</span></span> method.
RecursionError: maximum recursion depth exceeded while calling a Python object
</p>

<p>
The relationship between the descriptor object and an instance attribute:
</p>
<ol class="org-ol">
<li>if the descriptor object is assigned to a class attribute with name 'attribute_a', then it will control the instance attribute with the same name.</li>
<li>but there is  one exception: if only the <span class="underline"><span class="underline">get</span></span> method of a descriptor is defined, then the instance attribute with the same name will be not be controled by the  descriptor, it will be get directly from the <span class="underline"><span class="underline">dict</span></span>.</li>
</ol>

<p>
a test:
</p>
<div class="org-src-container">
<pre class="src src-python">class TraceDescriptor:
    def __init__(self, name):
        self.name = name

    def __get__(self, instance, cls):
        if instance:
            print('Getting attribute {}, value is {}'.format(self.name, instance.__dict__[self.name]))
            return instance.__dict__[self.name]
            # return getattr(instance, self.name)
        else:
            return instance


    def __set__(self, instance, value):
        print('Setting attribute {} to {}'.format(self.name, value))
        instance.__dict__[self.name] = value

class Circle:
    radius = TraceDescriptor('radius')
    def __init__(self,  radius):
        self.radius = radius

c =  Circle(4)

print(c.radius)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbceee7c" class="outline-3">
<h3 id="orgbceee7c">8.16. Defining More Than One Constructor in a Class, use a class method</h3>
<div class="outline-text-3" id="text-orgbceee7c">
<p>
GP: Always only assign values in the default  constructor(<span class="underline"><span class="underline">init</span></span>), and do other things by other constructors
</p>
<div class="org-src-container">
<pre class="src src-python">import time

class Date:
    def __init__(self, y, m,  d):
        self.year = y
        self.month = m
        self.day =  d

    @classmethod
    def today(cls):
        t = time.localtime()
        return cls(t.tm_year, t.tm_mon, t.tm_mday)

    def __str__(self):
        return '({0.year}, {0.month}, {0.day})'.format(self)

d1 = Date(2017, 1, 2)
d2 = Date.today()
print(d1, d2)

</pre>
</div>
</div>
</div>

<div id="outline-container-orgf08812c" class="outline-3">
<h3 id="orgf08812c">8.17. Creating an Instance Without Invoking init</h3>
<div class="outline-text-3" id="text-orgf08812c">
</div><div id="outline-container-org8fec581" class="outline-4">
<h4 id="org8fec581">the object.__new__(*args, **kwargs) method: create a bare object</h4>
<div class="outline-text-4" id="text-org8fec581">
<p>
Every object has a <span class="underline"><span class="underline">new__method, which is inheritantanted from type.__new</span></span>.
</p>

<p>
The parameter should be a type object.
</p>

<p>
When you want to create an object from a json, this method can be used.
</p>

<div class="org-src-container">
<pre class="src src-python">import aspk_common as AC
class Foo(AC.Structure):
    _fields = ['x']

f = Foo(2)
g = Foo.__new__(Foo)
print(f)
print(f.__dict__)
print(g.__dict__)
print(dir(f))
print(dir(g))
</pre>
</div>
</div>
</div>
<div id="outline-container-org32525e4" class="outline-4">
<h4 id="org32525e4">Problem: how an object is constructed?</h4>
<div class="outline-text-4" id="text-org32525e4">
<p>
I guess first create a bare object by  calling the <span class="underline"><span class="underline">new</span></span> method, then call the object's <span class="underline"><span class="underline">init</span></span> method.
</p>
</div>
</div>
</div>

<div id="outline-container-orgc96a25e" class="outline-3">
<h3 id="orgc96a25e">8.18. Extending Classes with Mixins</h3>
<div class="outline-text-3" id="text-orgc96a25e">
</div><div id="outline-container-org4208663" class="outline-4">
<h4 id="org4208663">mixin classes, used to extend function of a class, class customization, by multiple inheritance</h4>
<div class="outline-text-4" id="text-org4208663">
<p>
SOLVED, see another comment. How below codes works? For 'super().__getitem__(key)', why dict.__getitem__ method will be called?
</p>

<p>
After figuring out MRO, then I know how a mixin class works:
Mixin class is used to customize an existing class.
It make use of  MRO of multiple inheritance. Suppose 'Base' is the class to be customized, 'Mixin' is the mixin class, 'Foo' is the result  class, then the typical syntax is:
</p>
<div class="org-src-container">
<pre class="src src-python">class Foo(Mixin, Base):
    pass
</pre>
</div>
<p>
That is, put the mixin class as the first parent class, and the Base class as the second class. Then e.g. you want change a method of Base's behavier, such as 'foo', then you can just define a method named 'foo' in Mixin, and doing some work, then call 'super().foo(...)' to call Base's foo method.
</p>

<p>
Works like a decorator pattern.
</p>

<p>
But  what's difference between this method and by directly define the 'foo' method in Foo?
=&gt; maybe the main benifet is that  by putting the codes to a Mixin class, the codes can be easily reused.
</p>


<div class="org-src-container">
<pre class="src src-python">import aspk_common as AC
class Logging:
    __slots__ = ()
    def __getitem__(self, key):
        print('Getting {}'.format(key))
        print('self: {}\nsuper: {}'.format(self, super()))
        return super().__getitem__(key)

class LoggingDict(Logging, dict):
    pass

d = LoggingDict()
d['x'] = 2
print(d['x'])

</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org7d0b161" class="outline-3">
<h3 id="org7d0b161">mutiple inheritance: how method/attribue are resolved if they exists in more than one  super classes</h3>
<div class="outline-text-3" id="text-org7d0b161">
<p>
A method/attribute is resolved in the order of all parent class given.
e.g: 
class Foo(A, B)
if a method 'aaa' is defined in  both A and B, then A.aaa will be used.
</p>
</div>
</div>
