blog/2017/07/10/python-cookbook-readnote/index.html

<div id="outline-container-org3824642" class="outline-3">
<h3 id="org3824642">python multiple inheritance, super and MRO(method resolution order)</h3>
<div class="outline-text-3" id="text-org3824642">
<p>
Guoid's words:
<a href="http://python-history.blogspot.fi/2010/06/method-resolution-order.html">http://python-history.blogspot.fi/2010/06/method-resolution-order.html</a>
depth first, from left to right, then delete all same classes expect the last one. Then diamond problem is solved.
</p>

<p>
For below code snippets:
From the printout, super() will return the next class in MRO(method resolve order) list, given a current class. The next class can be a real parent class for current class, or if the real parent class not exists,  then the next class will be the next parent class of the  current instance. For both two conditions, they are always the same class in MRO.
</p>

<p>
For below codes: the MRO is [C, A, B].
</p>
<ul class="org-ul">
<li>So super() in class C's result is A</li>
<li>super() in  class A is B</li>
<li>super() in class B is object(I guess)</li>
</ul>
<div class="org-src-container">
<pre class="src src-python">class A:
    def foo(self):
        print("A")
        print(super())
        super().foo()
class B:
    def foo(self):
        print("B")
        print(super())

class C(A, B):
    def foo(self):
        print("C")
        print(super())
        super().foo()

o = C()
o.foo()
print("MRO of C: ", C.__class__.__mro__)
print("MRO() of C: ", C.__class__.mro(C))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc61723c" class="outline-3">
<h3 id="orgc61723c">8.19. Implementing Stateful Objects or State Machines</h3>
<div class="outline-text-3" id="text-orgc61723c">
<p>
Implementing the state pattern, by creating class for each state. In a class for one state, only define the method  use to handle the current state, all other methods should raise a 'NotImplementedError'.
Will see this latter
</p>
</div>
</div>

<div id="outline-container-orgb110ce9" class="outline-3">
<h3 id="orgb110ce9">8.20. Calling a Method on an Object Given the Name As a String, by getattr</h3>
<div class="outline-text-3" id="text-orgb110ce9">
<p>
A method is just an attribute of an object, so first get the method by 'getattr' given string name
</p>
<div class="org-src-container">
<pre class="src src-python">class Foo:
    def foo(self):
        print("foo")

f = Foo()
getattr(f, 'foo')()
</pre>
</div>
</div>
</div>

<div id="outline-container-org498afd6" class="outline-3">
<h3 id="org498afd6">8.20. Calling a Method on an Object Given the Name As a String, by operator.methodcaller(name, *args)</h3>
<div class="outline-text-3" id="text-org498afd6">
<p>
The benifit of methodcaller is that it will fix all parameters of the method. So if the method will be  called given same parameters for many differenntt object, this method might be better
</p>
<div class="org-src-container">
<pre class="src src-python">class Foo:
    def foo(self, x, y):
        print("foo: {}, {}".format(x, y))

f = Foo()
import operator
operator.methodcaller('foo', 3, 4)(f)
</pre>
</div>
</div>
</div>

<div id="outline-container-org1c849d3" class="outline-3">
<h3 id="org1c849d3">8.21. Implementing the Visitor Pattern</h3>
<div class="outline-text-3" id="text-org1c849d3">
<p>
感觉这里所说的vistor pattern主要是对用于处理包含不同类型对象的list. 用于通用处理。
基于类型系统的visitor pattern, 是通过在不同的基础类中的accept函数来实现 dispatch table的。相当于把dispatch table也耦合在基础类定义中了。
但最本质的目的是对于不同类型的对象，客户代码使用相同的代码进行处理。
</p>

<p>
将dispatch table 做在哪里，只影响一点点写法，对最终达到的效果没影响。
</p>


<p>
例子：
</p>
<div class="org-src-container">
<pre class="src src-python">class Visitor:
    def visit(self, node):
        methname = 'visit_' + type(node).__name__
        meth = getattr(self, methname, None)
        if meth is None:
            meth = self.generic_visit
        return meth(node)

    def generic_visit(self, node):
        raise RuntimeError('No {} method'.format('visit_' + type(node).__name__))

class File:
    def __init__(self, name):
        self.name = name

class RegularFile(File):
    def read_content(self):
        return "This is the content for file {}".format(self.name)

class Directory(File):
    def children(self):
        '''Return all children names as a list'''
        return [RegularFile('a.txt'), RegularFile('b.exe')]

class Symbolic(File):
    def real(self):
        '''Return real file this symbolic point to'''
        return RegularFile('dd.txt')

class CatVisitor(Visitor):
    '''Implement cat command for a File object.'''
    def  visit_RegularFile(self, node):
        print('content for regular file {}'.format(node.name))
        print(node.read_content())
    def visit_Directory(self, node):
        print('content for directory {}'.format(node.name))
        for f in node.children():
            self.visit(f)
    def visit_Symbolic(self, node):
        print('content for symbolic file {}'.format(node.name))
        self.visit(node.real())

files = [RegularFile('foo.txt'), Directory('bar'), RegularFile('a.txt'), Symbolic('aa.c')]
visitor = CatVisitor()
for file in files:
    visitor.visit(file)
    print()
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdb38c5f" class="outline-3">
<h3 id="orgdb38c5f">dispatch table in python, decided by object type</h3>
<div class="outline-text-3" id="text-orgdb38c5f">
<p>
将所有处理函数写在一个类中， 提供一个根据待处理对象类型分发的函数。 这个作为dispatch 基类。然后再定义针对每种类型的visit函数就行了。
这里类有两个目的：
</p>
<ol class="org-ol">
<li>定义dispatch table</li>
<li>对一组函数的名字空间吧。</li>
<li>以下例子中实现的 Dispatcher class 是通用的，可以共用。</li>
</ol>


<div class="org-src-container">
<pre class="src src-python">class Dispatcher:
    def visit(self, node):
        methname = 'visit_' + type(node).__name__
        meth = getattr(self, methname, None)
        if meth is None:
            meth = self.generic_visit
        return meth(node)

    def generic_visit(self, node):
        raise RuntimeError('No {} method'.format('visit_' + type(node).__name__))

class FooDispatcher(Dispatcher):
    def visit_RegularFile(self, node):
        pass
    def visit_Directory(self, node):
        pass
</pre>
</div>
</div>
</div>
<div id="outline-container-org63ef428" class="outline-3">
<h3 id="org63ef428">8.23. Managing Memory in Cyclic Data Structures, by weakref.ref(aobject)</h3>
<div class="outline-text-3" id="text-org63ef428">
<p>
When cyclic reference exists, the some  object will never be deleted, because its reference coutns is  large than 0.
A weakref is just a reference that don't increase the reference count. To dereference, just call it like a function. If the referenced object still exists, the object will be returne, otherwise None will be returned.
</p>

<p>
For a tree structure, the book give an example of reference the parent node by  weakref.
</p>

<p>
Note: you can't weakref to 'int', 'str', ...
</p>
<div class="org-src-container">
<pre class="src src-python">import weakref
class Node:
    pass
a = Node()
b = weakref.ref(a)
# c = a     # if this line exists, then a will not be deleted after 'del a', then the second call to b() will still return a

print(b())
del a
print(b())
</pre>
</div>
</div>
</div>

<div id="outline-container-org29cce0e" class="outline-3">
<h3 id="org29cce0e">8.24. Making Classes Support Comparison Operations, by define many comparision builtin method: <span class="underline"><span class="underline">eq</span></span>, <span class="underline"><span class="underline">lt</span></span>, <span class="underline"><span class="underline">le</span></span>, <span class="underline"><span class="underline">gt</span></span>, <span class="underline"><span class="underline">ge</span></span>, <span class="underline"><span class="underline">ne</span></span></h3>
</div>
<div id="outline-container-org3ea71e7" class="outline-3">
<h3 id="org3ea71e7">8.25. Creating Cached Instances, by  create a factory method(a class method)</h3>
<div class="outline-text-3" id="text-org3ea71e7">
<p>
If the parameter are the same, then return an existing object.
</p>
</div>
</div>
</div>

<div id="outline-container-orga8b4429" class="outline-2">
<h2 id="orga8b4429">chapter 5: Files and I/O</h2>
<div class="outline-text-2" id="text-orga8b4429">
</div><div id="outline-container-org3ca874c" class="outline-3">
<h3 id="org3ca874c">5.1. Reading and Writing Text Data</h3>
