blog/2017/07/10/python-cookbook-readnote/index.html
<div class="outline-text-3" id="text-org3ca874c">
</div><div id="outline-container-orgef39640" class="outline-4">
<h4 id="orgef39640">open a file</h4>
<div class="outline-text-4" id="text-orgef39640">
<p>
the 't' in mode means text.
</p>
<div class="org-src-container">
<pre class="src src-python">f = open('1.txt', 'rt') #read
# f = open('1.txt', 'wt') #write
# f = open('1.txt', 'at') #append

# specify codec
f = open('1.txt', 'rt', encoding='latin-1') #read
f = open('1.txt', 'wt', encoding='latin-1') #write

#disable newline translation, by use the open(newline='') option
f = open('1.txt', 'rt', newline='') #read

# specify what to do when encountering decoding/encoding errors, by use open(errors='...') option
f = open('1.txt', 'rt', errors='replace') #replace the char that can't be decoded to a unicode char U+fffd(which is the unicode replacemenet char)
f = open('1.txt', 'rt', errors='ignore') #just ignore the char that can't be decoded
</pre>
</div>
</div>
</div>


<div id="outline-container-org25131e9" class="outline-4">
<h4 id="org25131e9">read whole content of a file as a string</h4>
<div class="outline-text-4" id="text-org25131e9">
<div class="org-src-container">
<pre class="src src-python">with open('1.txt', 'rt') as f:
    s = f.read()
    print(s)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb126cf3" class="outline-4">
<h4 id="orgb126cf3">read/iterate each line of a file, by just treat the file object as a generator</h4>
<div class="outline-text-4" id="text-orgb126cf3">
<div class="org-src-container">
<pre class="src src-python">with open('1.txt', 'rt') as f:
    for line in f:
        print(line, end='')
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfffad23" class="outline-4">
<h4 id="orgfffad23">write str to a file, by file.write(text) method</h4>
<div class="outline-text-4" id="text-orgfffad23">
<div class="org-src-container">
<pre class="src src-python">with open('2.txt', 'wt') as f:
    f.write('abced')
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgc1c8b30" class="outline-3">
<h3 id="orgc1c8b30">get system's default encoding</h3>
<div class="outline-text-3" id="text-orgc1c8b30">
<div class="org-src-container">
<pre class="src src-python">import sys
print(sys.getdefaultencoding())
</pre>
</div>
</div>
</div>

<div id="outline-container-orge2ec329" class="outline-3">
<h3 id="orge2ec329">5.2. Printing to a File, redirect stdout to a file, by use print(file=...) option</h3>
<div class="outline-text-3" id="text-orge2ec329">
<div class="org-src-container">
<pre class="src src-python">with open('2.txt', 'wt') as f:
    print("aaaaa", file=f)
</pre>
</div>
</div>
</div>

<div id="outline-container-org2c39da5" class="outline-3">
<h3 id="org2c39da5">Question: how to redirect stdout to a file system widely.</h3>
</div>

<div id="outline-container-org4551a37" class="outline-3">
<h3 id="org4551a37">5.3. Printing with a Different Separator or Line Ending, by use print(sep=..., end=...) options</h3>
<div class="outline-text-3" id="text-org4551a37">
<div class="org-src-container">
<pre class="src src-python">print(1, 'abc')
print(1, 'abc', sep=', ', end='##')
print()
row = (45, 'Hello', 'List', 4)
print(row)
print(*row)
print(row, sep=', ')
print(*row, sep=', ')
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc84d3f7" class="outline-3">
<h3 id="orgc84d3f7">pass a sequence/list object to a function as N parameters instead of one, by using *list_name</h3>
<div class="outline-text-3" id="text-orgc84d3f7">
<div class="org-src-container">
<pre class="src src-python">row = (45, 'Hello', 'List', 4)
print(row)
print(*row)
print(row, sep=', ')
print(*row, sep=', ')
</pre>
</div>
</div>
</div>

<div id="outline-container-org56c666e" class="outline-3">
<h3 id="org56c666e">5.4. Reading and Writing Binary Data(such as image, sound files)</h3>
<div class="outline-text-3" id="text-org56c666e">
<p>
By saying binary data, it means that there will no encoding/decoding works during writing/reading process.
Use mode such as 'rb', 'wb', 'ab'.
</p>

<p>
当作为binary data读取时， 与作为text data相比，没有自动的decode, encode过程。
</p>

<div class="org-src-container">
<pre class="src src-python">with open('2.txt', 'wb') as f:
    # f.write('aaabbb'.encode('latin-1'))
    f.write(b'aaabbb')
</pre>
</div>
</div>
</div>


<div id="outline-container-org590f090" class="outline-3">
<h3 id="org590f090">what is text string and byte string in python</h3>
<div class="outline-text-3" id="text-org590f090">
<p>
Each element in a text string is also a text string, 
Each element in a byte string is a int
</p>
<div class="org-src-container">
<pre class="src src-python">s = 'Hello'
print(type(s), s, sep=', ')
for c in s:
    print(type(c), c, sep=', ')

s = b'Hello'
print(type(s), s, sep=', ')
for c in s:
    print(type(c), c, sep=', ')
</pre>
</div>
</div>
</div>

<div id="outline-container-org8a818ba" class="outline-3">
<h3 id="org8a818ba">5.5. Writing to a File That Doesn't Already Exist, by set mode of open(...) function to 'x'</h3>
<div class="outline-text-3" id="text-org8a818ba">
<p>
If the file already exists, then don't write, and will raise a FileExistsError exception
</p>
<div class="org-src-container">
<pre class="src src-python">with open('2.txt', 'xt') as f:
    f.write('aaa bbb')
</pre>
</div>

<p>
感觉这个根python的哲学有点类似，不事先做判断，而是用exception的方式。
具体的用法可能需要将它放在一个try catch里。
</p>
</div>
</div>

<div id="outline-container-orgf641c09" class="outline-3">
<h3 id="orgf641c09">5.6. Performing I/O Operations on a String, by io.StringIO() or io.BytesIO()</h3>
<div class="outline-text-3" id="text-orgf641c09">
<p>
a typecal application can be simulate a file when do unit testing.
</p>
</div>
</div>

<div id="outline-container-org8f93646" class="outline-3">
<h3 id="org8f93646">5.7. Reading and Writing Compressed Datafiles, by use gzip.open(...), or bz2.open(...)</h3>
<div class="outline-text-3" id="text-org8f93646">
<p>
After open the file, other operations are just the same as normal file.
</p>
</div>
</div>

<div id="outline-container-org38c8e21" class="outline-3">
<h3 id="org38c8e21">5.8. Iterating Over Fixed-Sized Records, by iter(callable, sentinel)</h3>
<div class="outline-text-3" id="text-org38c8e21">
<div class="org-src-container">
<pre class="src src-python">import functools
RECORD_SIZE = 2
with open('1.txt', 'rt') as f:
    for r in iter(functools.partial(f.read, RECORD_SIZE), ''):
        print(r, end='; ')
</pre>
</div>
</div>
</div>



<div id="outline-container-org2a0fa16" class="outline-3">
<h3 id="org2a0fa16">the functools.partial(func, *args, **kwargs) function: create a new callable from a given callable with some(partial) arguments fixed. Currying</h3>
<div class="outline-text-3" id="text-org2a0fa16">
<div class="org-src-container">
<pre class="src src-python">from functools import partial

def max(a, b):
    if a&gt;b: return a
    else: return b

mm = partial(max, 3)
print(mm(4))
print(mm(2))
print(mm())
</pre>
</div>

<p>
写一个能够接收很多参数的函数，然后利用partial 来生成简易的使用接口。需要注意参数的顺序。
</p>
</div>
</div>

<div id="outline-container-org5e02684" class="outline-3">
<h3 id="org5e02684">5.9. Reading Binary Data into a Mutable Buffer</h3>
</div>
