blog/python-cookbook-readnote.org
** 5.10. Memory Mapping Binary Files, map a binary file to memory(byte array), my mmap.mmap(...) method
   This is a general method to map file to memory, then you can random access the content of the file, such as by using slicing

   After mapped, by change the value of the array will change the file's content. This is also a way for multiple intepreter comunication.
   Below is a general function that map a file to a byte array.
   #+begin_src python :results output
   import os
   import mmap

   def memory_map(filename, access=mmap.ACCESS_WRITE):
       size = os.path.getsize(filename)
       fd = os.open(filename, os.O_RDWR)
       return mmap.mmap(fd, size, access=access)

   # below is application of the function
   f = memory_map('1.txt')
   print(f[2:8])
   f[0:3] = b'EEF'
   #+end_src

   #+RESULTS:
   : b'Faaa\r\n'

   
   
   
